{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1", "text": "Термины . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .1", "raw_entry_start": "3.1 Термины . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .1"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.2", "text": "Сокращения . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5 4 Ключевые характеристики больших данных . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5", "raw_entry_start": "3.2 Сокращения . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.1", "text": "Общие сведения . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5", "raw_entry_start": "4.1 Общие сведения . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2", "text": "Ключевые характеристики данных . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5", "raw_entry_start": "4.2 Ключевые характеристики данных . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3", "text": "Ключевые характеристики обработки данных . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5 Приложение А (справочное) Сквозные понятия в сфере больших данных . . . . . . . . . . . . . . . . . . . . . . . .8 Библиография . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .10 ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 IV Введение Установленные в настоящем стандарте термины и определения расположены в порядке, отражающем систему понятий данной области знания. Для каждого понятия установлен один стандартизованный термин. В стандарте приводятся эквиваленты стандартизованных терминов на английском (en) языке. Стандартизованные термины набраны полужирным шрифтом, их краткие формы — светлым, а недопустимые термины-синонимы — курсивом. ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» Дата введения — 2021—11—01 1 Область применения Настоящий стандарт содержит набор терминов и определений, необходимых для улучшения информационного взаимодействия и формирования русскоязычных понятий в области информационных технологий и больших данных. Он обеспечивает терминологическую основу для стандартов, связанных с большими данными. Термины, установленные настоящим стандартом, обязательны для применения во всех видах документации и литературы по данной научно-технической отрасли, входящих в сферу работ по стандартизации и (или) использующих результаты этих работ. 2 Нормативные ссылки Нормативные ссылки в настоящем стандарте отсутствуют. 3 Термины и определения В настоящем стандарте применены следующие термины с соответствующими определениями. ISO (ИСО) и IEC (МЭК) поддерживают терминологические базы данных для использования в стандартизации по следующим адресам: - Онлайн-библиотека стандартов ISO (ИСО): доступна по адресу: https://www.iso.org/obp; - Международный электротехнический словарь МЭК (IEC Electropedia): доступен по адресу: http:// www.electropedia.org/.", "raw_entry_start": "4.3 Ключевые характеристики обработки данных . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1", "text": "Термины", "raw_entry_start": "3.1 Термины"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.2", "text": "Сокращения JSON — обозначение объектов Javascript; PII — персональные данные; XML — расширяемый язык разметки. 4 Ключевые характеристики больших данных", "raw_entry_start": "3.2 Сокращения"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.1", "text": "Общие сведения При выборе системы больших данных необходимо руководствоваться четырьмя характеристиками — объемом, скоростью обработки, разнообразием и вариативностью данных (см. 4.2.4). Управление этими характеристиками определяется средствами обработки в соответствии с описанием в 4.2.", "raw_entry_start": "4.1 Общие сведения"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2", "text": "Ключевые характеристики данных", "raw_entry_start": "4.2 Ключевые характеристики данных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2.1", "text": "Объем данных. Объем данных представляет собой определенное количество данных, доступных для анализа с целью извлечения полезной информации. Одним из основных факторов развития технологий обработки больших данных стал рост объемов данных, как следствие интернет-активности.", "raw_entry_start": "4.2.1 Объем данных. Объем данных представляет собой определенное количество данных, до-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2.2", "text": "Скорость обработки данных. Скорость обработки данных — это скорость потока создания, хранения, анализа и визуализации данных. Скорость обработки больших данных означает необходимость обработки большого количества данных за короткий промежуток времени. В качестве примеров работы с данными с высокой скоростью обработки обычно приводят средства обработки потоковых данных.", "raw_entry_start": "4.2.2 Скорость обработки данных. Скорость обработки данных — это скорость потока создания,"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2.3", "text": "Разнообразие данных. Свойство разнообразия данных отражает необходимость анализа данных разных типов из различных предметных областей. Как правило, проблема разнообразия данных решалась посредством их преобразования или проведения предварительного анализа с целью выявления свойств, позволяющих объединить их с другими данными. Более широкий диапазон форматов данных, логических моделей, временных шкал и семантики, которые предпочтительно использовать при аналитике, усложняет интеграцию разнообразных данных. В качестве средства, способствующего интеграции, все чаще используются метаданные. Одним из результатов влияния разнообразия на большие данные является необходимость представления семантики данных в машиночитаемом виде.", "raw_entry_start": "4.2.3 Разнообразие данных. Свойство разнообразия данных отражает необходимость анализа"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.2.4", "text": "Вариативность данных. Вариативность данных означает изменения в скорости передачи данных, их формате/структуре, семантике и/или качестве, которые влияют на поддерживаемое приложение, аналитику или проблему. Влияние вариативности может заключаться в необходимости проведения реорганизации архитектур, интерфейсов, методов обработки/алгоритмов, интеграции/слияния, хранения, применимости или использования данных. В дополнение следует отметить, что вариативность объемов данных подразумевает необходимость увеличения или уменьшения виртуализированных ресурсов для эффективного управления дополнительной нагрузкой на обработку.", "raw_entry_start": "4.2.4 Вариативность данных. Вариативность данных означает изменения в скорости передачи"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3", "text": "Ключевые характеристики обработки данных", "raw_entry_start": "4.3 Ключевые характеристики обработки данных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.1", "text": "Наука о данных. Наука о данных изучает процесс извлечения из них знаний. Используемый научный подход может заключаться либо в проведении исследований, либо в проверке гипотез. Наука о данных изучает полный жизненный цикл аналитики данных, в котором аналитика данных понимается согласно 3.1.6.", "raw_entry_start": "4.3.1 Наука о данных. Наука о данных изучает процесс извлечения из них знаний. Используемый"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.2", "text": "Изменчивость данных. Изменчивость данных связана с ограниченным промежутком времени, в течение которого значения данных остаются актуальными для конкретного анализа, и определяется динамикой изменений. В тех ситуациях, когда аналитика данных проводится в режиме реального времени, немедленная обработка данных является критически необходимой для принятия решений. Наиболее очевидным образом это проявляется при работе с данными с высокой скоростью генерации, например с данными, связанными с фондовыми рынками или телекоммуникациями. Однако данные, не пригодные для спе - цифического, чувствительного к временным рамкам анализа ввиду устаревания, могут оставаться актуальными для других типов аналитики, не зависимых от времени.", "raw_entry_start": "4.3.2 Изменчивость данных. Изменчивость данных связана с ограниченным промежутком вре-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.3", "text": "Достоверность данных. Достоверность данных определяется их полнотой и точностью, в связи с чем для обозначения качества данных в профессиональном жаргоне длительное время суФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 ществует выражение «мусор на входе — мусор на выходе». Если аналитика данных направлена на установление причинно-следственных связей, то качество каждого элемента является крайне важным. Если аналитика осуществляется путем выявления корреляций или трендов в больших массивах данных, то отдельные некорректные элементы могут быть утеряны при общих подсчетах, но тренд может оставаться точным.", "raw_entry_start": "4.3.3 Достоверность данных. Достоверность данных определяется их полнотой и точностью,"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.4", "text": "Выгода. Выгода определяется степенью достижения системой обработки больших данных целей, для которых эта система создавалась.", "raw_entry_start": "4.3.4 Выгода. Выгода определяется степенью достижения системой обработки больших данных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.5", "text": "Визуализация данных. Под визуализацией данных подразумевается такое их представление, которое позволяет пользователю извлечь из них информацию. Большие данные потребовали новых методов обработки массивов данных больших объемов, включая сбор и обобщение данных для их наибольшей наглядности. Большие данные также требуют более пристального внимания к визуальному представлению для лиц, ответственных за принятие решений. Это необходимо для изложения результатов в доступном для понимания виде, а также для информирования об их сложности, точности и вероятностном интервале ошибок.", "raw_entry_start": "4.3.5 Визуализация данных. Под визуализацией данных подразумевается такое их представ-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.6", "text": "Структурированные и неструктурированные данные. Постоянно увеличиваются как объемы, так и значение неструктурированных данных. Хотя реляционные базы данных обычно поддерживают эти типы элементов данных, их способность непосредственно анализировать, индексировать и обрабатывать такие типы данных, как правило, ограничена и доступна через нестандартные расширения SQL. Потребность в анализе неструктурированных данных существует уже много лет. Однако переход на парадигму больших данных привел к повышению значимости неструктурированных данных. Также в отношении неструктурированных данных особое внимание уделяется различным новым методам разработки, которые позволят проводить анализ таких данных более эффективно.", "raw_entry_start": "4.3.6 Структурированные и неструктурированные данные. Постоянно увеличиваются как объ-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.7", "text": "Масштабирование. Большие данные подразумевают возможность расширения репозиториев данных и их обработку на параллельно работающих ресурсах — аналогичным образом сообщество специалистов, использующих моделирование, требующее ресурсоемких вычислений, массово перешло на параллельную обработку. Благодаря разработке методов взаимодействия между ресурсами, такое же масштабирование теперь доступно для приложений, использующих большое количество данных. Вертикальное масштабирование подразумевает увеличение системных параметров скорости обработки, хранения и памяти для повышения производительности. Этот подход ограничен физическими возможностями, развитие которых описано в законе Мура, и требует все более сложных элементов (например, аппаратного и программного обеспечения), приводящих к росту материальных и временных затрат на реализацию. Альтернативный метод состоит в применении горизонтального масштабирования, чтобы использовать отдельные распределенные ресурсы, объединяемые для работы в качестве единой системы. Именно горизонтальное масштабирование лежит в основе революции больших данных. Хотя методы достижения эффективной масштабируемости между ресурсами будут постоянно развиваться, эта смена парадигмы (по аналогии с предыдущим переходом на параллельную обработку в сообществе специалистов, используемых моделирование) представляет собой единовременное явление.", "raw_entry_start": "4.3.7 Масштабирование. Большие данные подразумевают возможность расширения репозитори-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.8", "text": "Распределенная файловая система. В распределенных файловых системах мультиструктурированные (объектные) массивы данных распределяются по вычислительным узлам кластера(ов) серверов. Данные могут распределяться на уровне файлов/массивов данных или — чаще всего — на уровне блоков, что позволяет нескольким узлам в кластере одновременно взаимодействовать с различными частями большого файла/массива данных. Системы больших данных часто проектируются таким образом, чтобы при распределении обработки использовать преимущества привязки данных к каждому вычислительному узлу, исключая необходимость перемещения данных между узлами. Кроме того, во многих распределенных файловых системах также реализована репликация на уровне файлов/блоков, при которой на разных узлах компьютеров хранится несколько копий каждого файла/блока как для обеспечения надежности/восстановления (данные не теряются при сбое узла в кластере), так и для улучшения привязки данных к вычислительным узлам. Любой тип данных и файлы любого размера могут обрабатываться без формального извлечения, преобразования и загрузки, при этом некоторые технологии работают заметно эффективнее с файлами большого размера.", "raw_entry_start": "4.3.8 Распределенная файловая система. В распределенных файловых системах мультиструк-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.9", "text": "Распределенная обработка данных. Популярная структура для распределенных вычислений состоит из комбинации уровня хранения и уровня обработки, которая реализует мультиклассовую модель алгоритмического программирования. Недорогие серверы потребительского уровня, поддерживающие распределенную файловую систему хранения данных, могут значительно снизить затраты на хранение вычислений для большого объема данных (например, индексация в сети). При распределенФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 ной обработке данных запрос распределен по процессорам, а результаты собираются в центральный процессор. Затем результаты обработки обычно загружаются в аналитическую среду. Для достижения эффективности, надежности, высокой доступности и отказоустойчивости системы несколько узлов (например, клиентские узлы, узлы данных, узлы-реплики) размещаются в виде архитектуры «ведущий— ведомый».", "raw_entry_start": "4.3.9 Распределенная обработка данных. Популярная структура для распределенных вычисле-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "4.3.10", "text": "Нереляционные базы данных. В горизонтально масштабируемых системах данные распределяются по узлам кластера, имея при этом единую логическую структуру. Новые парадигмы базы данных нереляционной модели обычно называют NoSQL («не только SQL» или «не SQL»). Проблема с определением парадигмы хранения больших данных как NoSQL заключается, во-первых, в описании хранения данных на теоретико-множественном языке для запросов и извлечения данных и, во-вторых, в расширении возможностей применения языков запросов, похожих на SQL, к новым нереляционным хранилищам данных. В то время как NoSQL используется настолько широко, что будет применяться в новых моделях данных вне рамок реляционной модели, сам термин относится к базам данных, не следующим реляционной модели. Примерами моделей нереляционных баз данных являются столбец, разреженная таблица, ключ-значение, документ-ключ и графические модели. ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 Приложение А (справочное) Сквозные понятия в сфере больших данных А.1 Общие сведения Развитие систем больших данных оказывает влияние на дискуссии и процессы стандартизации в других технологических областях. В данном приложении обсуждаются связи области больших данных с другими областями разработки стандартов. А.2 Метаданные Метаданные представляют собой описательные данные, включая, например, описание истории обработки данных. Системы больших данных спроектированы для выполнения распределенной обработки данных, в том числе тех, которые являются внешними и не находятся под контролем системы больших данных, поэтому использование метаданных становится все более значимой концепцией. Большие данные повторно используются для целей, не связанных с целями, для которых они собирались, поэтому важно, чтобы любые данные, доступ к которым предоставляется другим сторонам, были снабжены адекватными метаданными. Метаданные также включают в себя сведения об источниках данных и об использовании данных. Их можно разделить на бизнес- и технические метаданные. А.3 Алгоритмы При разработке алгоритмов анализа больших данных необходимо учитывать требования распределенной обработки, поскольку ранее данные обычно хранились на локальных устройствах. Алгоритмы обработки больших данных в узлах должны быть адаптированы к горизонтальному масштабированию, чтобы явно учитывать распределение данных по узлам. А.4 Кластерные вычисления Кластерные вычисления относятся к распределению процессов по компьютерной сети. Для работы аппаратной среды как единого целого используется специализированное программное обеспечение. Если поместить уровень служб поверх аппаратной среды, то будут достигнуты преимущества облачных вычислений. П р и м е ч а н и е — В данном перефразированном определении кластерных вычислений под кластером понимается «комбинация набора взаимосвязанных компьютеров/серверов». А.5 Облачные вычисления Облачные вычисления — одна из парадигм доступности и управления ресурсами для систем больших данных. Существует несколько ключевых характеристик, часто присущих применению облачных вычислений, в том числе: широкополосный доступ, измеримое обслуживание, многопользовательский режим, самообслуживание по требованию, быстрая адаптация и масштабируемость, а также объединение ресурсов. Облачные вычисления для инфраструктуры, платформ или приложений могут применяться при формировании системы больших данных. А.6 Безопасность данных Системы больших данных из-за распределенного характера обработки имеют дополнительные проблемы с безопасностью. Дополнительные уязвимости возникают, например, при распределенном использовании и управлении физической компьютерной и сетевой инфраструктурами, а также при контроле доступа на каждом слое программного обеспечения и системы хранения. Обычно в среде распределенной обработки данных осуществляются шифрование, маскирование и управление доступом на основе ролей для обеспечения всесторонней защиты данных на всех слоях, включая передачу данных по сети. Некоторые примеры массивов данных, для которых обязателен высокий уровень безопасности, включают конфиденциальную информацию о клиентах, сведения о продуктах, коммерческие сведения компаний, данные счетов и финансовые транзакции, медицинские записи пациентов, а также сведения, относящиеся к национальной обороне и безопасности. А.7 Требования по защите персональных данных Существуют законодательные и нормативные требования, которые влияют на использование персональных данных и регулируют его. Все больше персональных данных можно получить из сети Интернет, социальных сетей, устройств слежения и т. д. В широком смысле защита персональных данных — это совокупность правовых и нормативных требований, которые обеспечивают право отдельных лиц на контроль не только над использованием их персональных данных, но также их достоверностью, аспектами жизненного цикла (включая принудительное удаление) и т. д. Кроме того, ключевым правом защиты персональных данных является право «информированного согласия» человека в отношении использования его персональных данных. Интеграция массивов данных из разнородных источников может приводить к созданию наборов персональных данных или получению нового способа их ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 использования, отличного от цели, для которой получено осознанное согласие конкретного лица на использование таких персональных данных. Поэтому любая организация, разрабатывающая и использующая системы больших данных, несет юридическую и фидуциарную ответственность за обеспечение полной поддержки и внедрения всех применимых норм по защите персональных данных в тех случаях, когда их деятельность связана с обработкой персональных данных. А.8 SQL SQL — это стандартный (см. серию стандартов ИСО/МЭК 9075) интерактивный язык программирования, предназначенный для создания запросов, обновления и управления данными и их массивами в базе данных. SQL предназначен для работы со структурированными данными и предоставляет полноценную и всеобъемлющую структуру для доступа к данным, а также поддерживает широкий спектр эффективных аналитических функций. Расширения баз данных SQL поддерживают обнаружение столбцов в широком диапазоне массивов данных: не только реляционных таблиц/представлений, но также XML, JSON, пространственных объектов, объектов, схожих с изображениями (больших двоичных объектов и больших символьных объектов), и семантических объектов. Системы управления данными NoSQL, предназначенные для поддержки нетабличных структурированных данных, а также неструктурированных и полуструктурированных данных, еще не сделали выбор в пользу одного общего языка доступа. Во многих вариантах реализации NoSQL приняты SQL-подобные языки, включающие некоторое подмножество стандартного SQL с расширениями, поддерживающими специфические особенности реализаций NoSQL. А.9 Параллельные вычисления Большие данные обычно связаны с распределенной интенсивной обработкой данных в узлах кластера. Сообщество специалистов в области моделирования уже много лет разрабатывает методы интенсивного использования компьютерных вычислений в больших вычислительных кластерах. Учитывая, что оба подхода представляют собой крайние случаи для крупномасштабных вычислений и анализа данных, технологии обоих подходов будут использоваться для спектра возможностей, требующих как интенсивных компьютерных вычислений, так и интенсивной обработки данных. А.10 Интернет вещей Одновременно с увеличением объема данных создаются вычислительные системы, способные эти данные анализировать. Пользователи предпочитают использовать объем данных, доступных с различных сенсоров и других источников, что обеспечивает эффективную предсказательную аналитику для управления и контроля сетевых решений. Технологические достижения в области сенсоров, а также развертывание протокола IPV6 для обеспечения интернет-коннективности этих устройств порождают потребность в системах больших данных, которые могут обрабатывать потоковые данные из нескольких источников, обладающих высокой скоростью генерации. Подобные системы отличаются от систем, создаваемых для пакетной обработки малого числа больших массивов данных. Различие в характеристиках массивов данных оказывает прямое влияние на архитектуру систем и методы анализа данных. А.11 Языки программирования Анализ расширенных данных с использованием статистических вычислений является фундаментальным методом в парадигме больших данных. Системы аналитики больших данных могут разрабатываться с использованием базовых языков программирования. Потребности в распределенной обработке данных привели к появлению новых языков программирования, языков запросов и процессов обработки, пригодных для создания систем больших данных. Языки программирования (см. примечание), как правило, имеют общедоступные среды разработки, библиотеки и среды выполнения для обеспечения эффективной обработки больших данных с использованием параллельных вычислений и хранения. Среди новых процессов — распределение—сборка данных для их распределенной обработки. П р и м е ч а н и е — Примеры языков включают в себя R, Python, Scala, Java и т. д. ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 Библиография [1] ISO/IEC 2382:2015, Information technology — Vocabulary [2] ISO 9075 (all parts), Information technology — Database languages — SQL [3] ISO/IEC 11404, Information technology — General-Purpose Datatypes (GPD) [4] ISO/IEC 17788:2014, Information technology — Cloud computing — Overview and vocabulary [5] ISO/IEC 19784-4:2011, Information technology — Biometric application programming interface — Part 4: Biometric sensor function provider interface ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021 УДК 004.01:006.354 ОКС 35.020 Ключевые слова: информационные технологии (ИТ), данные, большие данные, аналитика данных, база данных, модель данных, наука о данных, массив данных, тип данных, вариативность данных, разнообразие данных, скорость обработки данных, достоверность данных, изменчивость данных, объем данных, распределенная обработка данных, неструктурированные данные, частично структурированные данные, потоковые данные ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» Технический редактор И.Е. Черепкова Корректор Е.Д. Дульнева Компьютерная верстка Е.А. Кондрашовой Сдано в набор 13.07.2021. Подписано в печать 15.07.2021. Формат 60×84⅛. Гарнитура Ариал. Усл. печ. л. 1,86. Уч.-изд. л. 1,68. Подготовлено на основе электронной версии, предоставленной разработчиком стандарта Создано в единичном исполнении во ФГУП «СТАНДАРТИНФОРМ» для комплектования Федерального информационного фонда стандартов, 117418 Москва, Нахимовский пр-т, д. 31, к. 2. www.gostinfo.ru info@gostinfo.ru ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ", "raw_entry_start": "4.3.10 Нереляционные базы данных. В горизонтально масштабируемых системах данные рас-"}
