{"standard_id": "", "source_file": "83677.pdf", "article": "3.1", "term_ru": "авторизация", "term_en": null, "definition": "Проверка, подтверждение и предоставление прав логического доступа при осуществлении субъектами доступа логического доступа. [ГОСТ Р 57580.1—2017, пункт 3.15]", "raw_entry_start": "3.1 (split) + авторизация: Проверка, подтверждение и предоставление прав логического доступа при осу­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.2", "term_ru": "архитектура директорий", "term_en": null, "definition": "Система хранения данных, которые могут находиться в разделах жесткого диска и оперативной памяти электронно-вычислительной машины. ГОСТ Р 71675—2024 Примечание — Архитектура директорий определяет, какую структуру принимают файлы в каждом из разделов, создает правила для их генерации, а также управляет файлами в соответствии с особенностями каждой конкретной файловой системы.", "raw_entry_start": "3.2 архитектура директорий: Система хранения данных, которые могут находиться в разделах"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.3", "term_ru": "аутентификация", "term_en": null, "definition": "Действия по проверке подлинности субъекта доступа и/или объекта доступа, а также по проверке принадлежности субъекту доступа и/или объекту доступа предъявленного идентификатора доступа и аутентификационной информации. Примечание — Аутентификация рассматривается применительно к конкретному субъекту доступа и/или конкретному объекту доступа. [ГОСТ Р 58833—2020, пункт 3.4]", "raw_entry_start": "3.3 (split) + аутентификация: Действия по проверке подлинности субъекта доступа и/или объекта доступа,"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.4", "term_ru": "безопасность информации [данных]", "term_en": null, "definition": "Состояние защищенности информации [данных], при котором обеспечиваются ее [их] конфиденциальность, доступность и целостность. [ГОСТ Р 50922—2006, пункт 2.4.5] Примечание — Безопасность информации (данных) определяется отсутствием недопустимого риска, связанного с утечкой информации по техническим каналам, несанкционированными и непреднамеренными воздействиями на данные и (или) на другие ресурсы автоматизированной информационной системы, используемые при применении информационной технологии.", "raw_entry_start": "3.4 (split) + безопасность информации [данных]: Состояние защищенности информации [данных], при ко­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.5", "term_ru": "врачебная комиссия", "term_en": null, "definition": "Особый орган, функционирующий на постоянной регулярной основе при каждой медицинской организации, в целях совершенствования организации оказания медицинской помощи, принятия решений в наиболее сложных и конфликтных случаях по вопросам профилактики, диагностики, лечения и медицинской реабилитации, определения трудоспособности граждан и профессиональной пригодности некоторых категорий работников, осуществления оценки качества, обоснованности и эффективности лечебно-диагностических мероприятий, в том числе, назначения лекарственных препаратов, обеспечения назначения и коррекции лечения в целях учета данных пациентов при обеспечении лекарственными препаратами, трансплантации (пересадки) органов и тканей человека, а также принятия решения по иным медицинским вопросам.", "raw_entry_start": "3.5 врачебная комиссия: Особый орган, функционирующий на постоянной регулярной основе"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.6", "term_ru": "голосовой помощник", "term_en": null, "definition": "Программный продукт, созданный в том числе с использованием технологий искусственного интеллекта, предназначенный для распознавания человеческой речи, реагирования и выполнения действий в ответ на устный запрос.", "raw_entry_start": "3.6 голосовой помощник: Программный продукт, созданный в том числе с использованием тех­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.7", "term_ru": "информация", "term_en": null, "definition": "Сведения (сообщения, данные) независимо от формы их представления. [[1], статья 2]", "raw_entry_start": "3.7 (split) + информация: Сведения (сообщения, данные) независимо от формы их представления."}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.8", "term_ru": "клинические рекомендации", "term_en": null, "definition": "Документы, содержащие основанную на научных доказательствах структурированную информацию по вопросам профилактики, диагностики, лечения и реабилитации, в том числе протоколы ведения (протоколы лечения) пациента, варианты медицинского вмешательства и описание последовательности действий медицинского работника с учетом течения заболевания, наличия осложнений и сопутствующих заболеваний, иных факторов, влияющих на результаты оказания медицинской помощи.", "raw_entry_start": "3.8 клинические рекомендации: Документы, содержащие основанную на научных доказа­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.9", "term_ru": "конфиденциальность информации", "term_en": null, "definition": "Обязательное для выполнения лицом, получившим доступ к определенной информации, требование не передавать такую информацию третьим лицам без согласия ее обладателя. [[1], статья 2]", "raw_entry_start": "3.9 (split) + конфиденциальность информации: Обязательное для выполнения лицом, получившим до­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.10", "term_ru": "лечащий врач", "term_en": null, "definition": "Врач, на которого возложены функции по организации и непосредственному оказанию пациенту медицинской помощи в период наблюдения за ним и его лечения. [[2], статья 2] ГОСТ Р 71675—2024", "raw_entry_start": "3.10 (split) + лечащий врач: Врач, на которого возложены функции по организации и непосредственному ока­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.11", "term_ru": "медицинские изделия (изделия медицинского назначения и медицинская техника)", "term_en": null, "definition": "Любые инструменты, аппараты, приборы, оборудование, материалы и прочие изделия, применяемые в медицинских целях отдельно или в сочетании между собой, а также вместе с другими принадлежностями, необходимыми для применения указанных изделий по назначению, включая специальное программное обеспечение, и предназначенные производителем для профилактики, диагностики, лечения и медицинской реабилитации заболеваний, мониторинга состояния организма человека, проведения медицинских исследований, восстановления, замещения, изменения анатомической структуры или физиологических функций организма, предотвращения или прерывания беременности, функциональное назначение которых не реализуется путем фармакологического, иммунологического, генетического или метаболического воздействия на организм человека. [[2], статья 38]", "raw_entry_start": "3.11 (split) + медицинские изделия (изделия медицинского назначения и медицинская техника): Лю­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.12", "term_ru": "пациент", "term_en": null, "definition": "Физическое лицо, которому оказывается медицинская помощь или которое обратилось за оказанием медицинской помощи независимо от наличия у него заболевания и от его состояния. [[2], статья 2]", "raw_entry_start": "3.12 (split) + пациент: Физическое лицо, которому оказывается медицинская помощь или которое обратилось"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.13", "term_ru": "программный продукт", "term_en": null, "definition": "Программное средство, предназначенное для поставки, передачи, продажи пользователю. [ГОСТ 28806—90, статья 3]", "raw_entry_start": "3.13 (split) + программный продукт: Программное средство, предназначенное для поставки, передачи, про­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.14", "term_ru": "риск", "term_en": null, "definition": "Вероятность причинения вреда жизни или здоровью граждан, имуществу физических или юридических лиц, государственному или муниципальному имуществу, окружающей среде, жизни или здоровью животных и растений с учетом тяжести этого вреда. [[3], статья 2]", "raw_entry_start": "3.14 (split) + риск: Вероятность причинения вреда жизни или здоровью граждан, имуществу физических или"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.15", "term_ru": "сетевое хранилище (сетевая система хранения данных)", "term_en": null, "definition": "Устройство хранения данных, которое обеспечивает постоянный доступ к данным для эффективной совместной работы участников процесса дистанционного мониторинга по сети.", "raw_entry_start": "3.15 сетевое хранилище (сетевая система хранения данных): Устройство хранения данных,"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.16", "term_ru": "система дистанционного мониторинга", "term_en": null, "definition": "Интеллектуальная информационная система, предназначенная для сбора, хранения, обработки и представления информации, касающейся деятельности медицинских организаций и предоставляемых ими услуг в отношении дистанционного наблюдения за состоянием здоровья пациента.", "raw_entry_start": "3.16 система дистанционного мониторинга: Интеллектуальная информационная система,"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.17", "term_ru": "система искусственного интеллекта", "term_en": null, "definition": "Программное обеспечение, в котором используются технологические решения искусственного интеллекта. [ГОСТ Р 59921.6—2021, пункт 3.10]", "raw_entry_start": "3.17 (split) + система искусственного интеллекта: Программное обеспечение, в котором используются тех­"}
{"standard_id": "", "source_file": "83677.pdf", "article": "3.18", "term_ru": "телемедицинские технологии", "term_en": null, "definition": "Информационные технологии, обеспечивающие дистанционное взаимодействие медицинских работников между собой, с пациентами и (или) их законными представителями, идентификацию и аутентификацию указанных лиц, документирование совершаемых ими действий при проведении консилиумов, консультаций, дистанционного медицинского наблюдения за состоянием здоровья пациента. [[2], статья 2] 4 Обозначения и сокращения В настоящем стандарте применены следующие обозначения и сокращения: CSQ-8 — опросник удовлетворенности клиента услугой (Client Satisfaction Questionnaire); ГОСТ Р 71675—2024 ИИ — искусственный интеллект; НСИ — нормативно-справочная информация; СДМ — система дистанционного мониторинга; СИИ — система искусственного интеллекта. 5 Общие положения", "raw_entry_start": "3.18 (split) + телемедицинские технологии: Информационные технологии, обеспечивающие дистанционное"}
