{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.1", "term_ru": "выгода", "term_en": "benefit", "definition": "Польза для организации от практически полезных знаний, полученных из аналитической системы. П р и м е ч а н и е — Большие данные часто ассоциируются с выгодой вследствие понимания того, что данные имеют потенциальную ценность, ранее обычно не рассматриваемую.", "raw_entry_start": "3.1.1 выгода (benefit): Польза для организации от практически полезных знаний, полученных из"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.2", "term_ru": "большие данные", "term_en": "big data", "definition": "Большие массивы данных (3.1.11), отличающиеся главным образом такими характеристиками, как объем, разнообразие, скорость обработки и/или вариативность, которые требуют использования технологии масштабирования для эффективного хранения, обработки, управления и анализа. П р и м е ч а н и е — Термин «большие данные» широко применяется в различных значениях, например в качестве наименования технологии масштабирования, используемой для обработки больших массивов данных. ГОСТ Р ИСО/МЭК 20546—2021 Н А Ц И О Н А Л Ь Н Ы Й С Т А Н Д А Р Т Р О С С И Й С К О Й Ф Е Д Е Р А Ц И И Информационные технологии БОЛЬШИЕ ДАННЫЕ Обзор и словарь Information technology. Big data. Overview and vocabulary ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021", "raw_entry_start": "3.1.2 большие данные (big data): Большие массивы данных (3.1.11), отличающиеся главным об-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.3", "term_ru": "облачные вычисления", "term_en": "cloud computing", "definition": "Парадигма для предоставления возможности сетевого доступа к масштабируемому и эластичному пулу общих физических или виртуальных ресурсов с предоставлением самообслуживания и администрированием по требованию. П р и м е ч а н и е — Примерами таких ресурсов являются серверы, операционные системы, сети, программное обеспечение, приложения и оборудование для хранения. [ИСО/МЭК 17788:2014, 3.2.5]", "raw_entry_start": "3.1.3 облачные вычисления (cloud computing): Парадигма для предоставления возможности се-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.4", "term_ru": "кластер (в распределенной обработке данных)", "term_en": "cluster", "definition": "Совокупность функциональных устройств, находящихся под общим управлением. [ИСО/МЭК 2382:2015, 4.496]", "raw_entry_start": "3.1.4 кластер (в распределенной обработке данных) (cluster): Совокупность функциональных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.5", "term_ru": "данные", "term_en": "data", "definition": "Представление информации в формальном виде, пригодном для передачи, интерпретации или обработки. П р и м е ч а н и е — Данные могут быть обработаны автоматически или вручную. [ИСО/МЭК 2382:2015, 4.259]", "raw_entry_start": "3.1.5 данные (data): Представление информации в формальном виде, пригодном для передачи,"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.6", "term_ru": "аналитика данных", "term_en": "data analytics", "definition": "Составное понятие, охватывающее получение, сбор, проверку и обработку данных (3.1.9), включая их количественную оценку, визуализацию и интерпретацию. П р и м е ч а н и е — Аналитика данных используется для представления объектов, описываемых данными (3.1.5), с целью прогнозирования конкретных ситуаций и формирования пошаговых рекомендаций при решении задач. Закономерности, полученные посредством аналитики, используются в различных целях, таких как принятие решений, проведение исследований, обеспечение устойчивого развития, проектирование, планирование и т. д.", "raw_entry_start": "3.1.6 аналитика данных (data analytics): Составное понятие, охватывающее получение, сбор,"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.7", "term_ru": "база данных", "term_en": "database", "definition": "Совокупность данных (3.1.5), организованная в соответствии с концептуальной структурой, в которой описываются характеристики этих данных и взаимосвязи между представляемыми ими сущностями для одной или нескольких областей применения. [ИСО/МЭК 2382:2015, 2121413]", "raw_entry_start": "3.1.7 база данных (database): Совокупность данных (3.1.5), организованная в соответствии с кон-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.8", "term_ru": "модель данных", "term_en": "data model", "definition": "Схема данных (3.1.5), структурированная в базе данных (3.1.7) в соответствии с формальными описаниями в информационной системе и требованиями используемой системы управления базой данных. [ИСО/МЭК 2382:2015, 2125519]", "raw_entry_start": "3.1.8 модель данных (data model): Схема данных (3.1.5), структурированная в базе данных (3.1.7)"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.9", "term_ru": "обработка данных", "term_en": "data processing", "definition": "Систематическое выполнение операций с данными (3.1.5). П р и м е ч а н и я 1 Арифметические или логические операции с данными, объединение или сортировка данных или такие операции с текстом, как редактирование, сортировка, объединение, хранение, извлечение, отображение или печать. 2 Термин «обработка данных» не должен использоваться в качестве синонима для термина «обработка информации». [ИСО/МЭК 2382:2015, 2121276]", "raw_entry_start": "3.1.9 обработка данных (data processing): Систематическое выполнение операций с данными"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.10", "term_ru": "наука о данных", "term_en": "data science", "definition": "Извлечение практических знаний из данных (3.1.5) посредством исследования или создания и проверки гипотез.", "raw_entry_start": "3.1.10 наука о данных (data science): Извлечение практических знаний из данных (3.1.5) посред-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.11", "term_ru": "массив данных", "term_en": "data set, dataset", "definition": "Идентифицируемая совокупность данных (3.1.5), к которой можно получить доступ или скачать в одном или нескольких форматах. [Адаптировано из ИСО 19115-2:2009, 4.7]", "raw_entry_start": "3.1.11 массив данных (data set, dataset): Идентифицируемая совокупность данных (3.1.5), к кото-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.12", "term_ru": "тип данных", "term_en": "data type, datatype", "definition": "Совокупность объектов данных (3.1.5) установленной структуры и набора допустимых операций над этими объектами. П р и м е ч а н и я 1 Целочисленный тип данных имеет простую структуру, каждый экземпляр которой, обычно называемый значением, представляет собой одно из целых чисел из заданного диапазона, а допустимые действия включают в себя обычные арифметические операции над этими целыми числами. 2 Если толкование не вызывает сомнений, то вместо термина «тип данных» может быть использован термин «тип». 3 Тип данных: определение и термины, стандартизованные ИСО/МЭК [ИСО/МЭК 2382-15:1999]. [ИСО/МЭК 2382:2015, 2122374] ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021", "raw_entry_start": "3.1.12 тип данных (data type, datatype): Совокупность объектов данных (3.1.5) установленной"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.13", "term_ru": "вариативность данных", "term_en": "data variability", "definition": "Изменения в скорости передачи, формате или структуре, семантике или качестве массива данных (3.1.11).", "raw_entry_start": "3.1.13 вариативность данных (data variability): Изменения в скорости передачи, формате или"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.14", "term_ru": "разнообразие данных", "term_en": "data variety", "definition": "Диапазон форматов, логических моделей, временных шкал и семантики массива данных (3.1.11). П р и м е ч а н и е — Данное понятие отражает нерегулярность и разнородность структур данных, навигации по структурам, запросов и типов данных.", "raw_entry_start": "3.1.14 разнообразие данных (data variety): Диапазон форматов, логических моделей, временных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.15", "term_ru": "скорость обработки данных", "term_en": "data velocity", "definition": "Скорость потока, с которой данные (3.1.5) создаются, передаются, сохраняются, анализируются или визуализируются.", "raw_entry_start": "3.1.15 скорость обработки данных (data velocity): Скорость потока, с которой данные (3.1.5) соз-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.16", "term_ru": "достоверность данных", "term_en": "data veracity", "definition": "Полнота и/или точность данных (3.1.5). П р и м е ч а н и е — Под достоверностью данных понимают описательные данные и самоанализ объектов для поддержки принятия решений в режиме реального времени.", "raw_entry_start": "3.1.16 достоверность данных (data veracity): Полнота и/или точность данных (3.1.5)."}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.17", "term_ru": "изменчивость данных", "term_en": "data volatility", "definition": "Характеристика данных (3.1.5), относящаяся к скорости их изменения с течением времени. [ИСО/МЭК 2382:2015, 2121506]", "raw_entry_start": "3.1.17 изменчивость данных (data volatility): Характеристика данных (3.1.5), относящаяся к ско-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.18", "term_ru": "объем данных", "term_en": "data volume", "definition": "Количественная характеристика данных (3.1.5), влияющая на выбор ресурсов для вычислений и хранения, а также на управление данными в процессе обработки. П р и м е ч а н и е — Объем данных становится важным при работе с большими массивами данных (3.1.11).", "raw_entry_start": "3.1.18 объем данных (data volume): Количественная характеристика данных (3.1.5), влияющая на"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.19", "term_ru": "распределенная обработка данных", "term_en": "distributed data processing", "definition": "Обработка данных, при которой выполнение операций распределено по узлам вычислительной сети. [ИСО/МЭК 2382:2015, 4.1166]", "raw_entry_start": "3.1.19 распределенная обработка данных (distributed data processing): Обработка данных, при"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.20", "term_ru": "распределенная файловая система", "term_en": "distributed file system", "definition": "Система, управляющая файлами и папками в нескольких связанных сетью системах.", "raw_entry_start": "3.1.20 распределенная файловая система (distributed file system): Система, управляющая фай-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.21", "term_ru": "файл", "term_en": "file", "definition": "Поименованная совокупность записей, рассматриваемая как единое целое. [ИСО/МЭК 2382:2015, 4.1470]", "raw_entry_start": "3.1.21 файл (file): Поименованная совокупность записей, рассматриваемая как единое целое."}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.22", "term_ru": "сборка", "term_en": "gather", "definition": "Объединение результатов из нескольких узлов в кластере. П р и м е ч а н и е — См. распределение—сборка (3.2.33)1).", "raw_entry_start": "3.1.22 сборка (gather): Объединение результатов из нескольких узлов в кластере."}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.23", "term_ru": "горизонтальное масштабирование", "term_en": "horizontal scaling", "definition": "Формирование единого логического целого путем соединения нескольких аппаратно-программных комплексов. П р и м е ч а н и я 1 Примером горизонтального масштабирования является повышение производительности распределенной обработки данных путем добавления узлов в кластере с целью подключения (привлечения) дополнительных ресурсов. 2 Горизонтальное масштабирование для увеличения производительности также называется масштабированием вширь (scale-out).", "raw_entry_start": "3.1.23 горизонтальное масштабирование (horizontal scaling): Формирование единого логическо-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.24", "term_ru": "метаданные", "term_en": "metadata", "definition": "Данные (3.1.5) о данных или элементах данных, которые могут включать описание, а также сведения о владельце данных, путях доступа к ним, правах доступа и изменчивости данных (3.1.17). [ИСО/МЭК 2382:2015, 2121505]", "raw_entry_start": "3.1.24 метаданные (metadata): Данные (3.1.5) о данных или элементах данных, которые могут"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.25", "term_ru": "нереляционная база данных", "term_en": "non-relational database", "definition": "База данных (3.1.7), не соответствующая реляционной модели (3.1.31). П р и м е ч а н и е — «NoSQL», что обычно переводится как «не SQL» или «не только SQL», является общеупотребительным термином для обозначения баз данных, не соответствующих реляционной модели.", "raw_entry_start": "3.1.25 нереляционная база данных (non-relational database): База данных (3.1.7), не соответ-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.26", "term_ru": "нереляционная модель данных", "term_en": "non-relational model", "definition": "Логическая модель данных (3.1.10), не соответствующая реляционной модели (3.1.31) хранения и обработки данных (3.1.5).", "raw_entry_start": "3.1.26 нереляционная модель данных (non-relational model): Логическая модель данных (3.1.10),"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.27", "term_ru": "параллельность", "term_en": "parallel", "definition": "Относится к процессу, в котором все события происходят в одном и том же интервале времени, и при этом каждое из них обрабатывается отдельной, но схожей функциональной единицей. П р и м е ч а н и е — Параллельная передача битов компьютерного слова по линиям внутренней шины. [ИСО/МЭК 2382:2015, 2121654] 1) Согласно оригиналу. ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021", "raw_entry_start": "3.1.27 параллельность (parallel): Относится к процессу, в котором все события происходят в од-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.28", "term_ru": "частично структурированные данные", "term_en": "partially structured data", "definition": "Данные (3.1.5), в которых присутствует определенная степень организации. П р и м е ч а н и я 1 Частично структурированные данные в практической деятельности часто называют полуструктурированными. 2 Примерами частично структурированных данных являются записи со свободными текстовыми полями в дополнение к более структурированным данным. Такие данные часто представлены в компьютерно-интерпретируемых/разбираемых форматах, таких как XML или JSON. [ИСО/МЭК 2382:2015, 2121654]", "raw_entry_start": "3.1.28 частично структурированные данные (partially structured data): Данные (3.1.5), в которых"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.29", "term_ru": "реляционная алгебра", "term_en": "relational algebra", "definition": "Алгебра для выражения и манипулирования отношениями. [ИСО/МЭК 2382:2015, 2121473]", "raw_entry_start": "3.1.29 реляционная алгебра (relational algebra): Алгебра для выражения и манипулирования от-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.30", "term_ru": "реляционная база данных", "term_en": "relational database", "definition": "База данных (3.1.7), данные в которой организованы по реляционной модели (3.1.31). [ИСО/МЭК 2382:2015, 2121470]", "raw_entry_start": "3.1.30 реляционная база данных (relational database): База данных (3.1.7), данные в которой"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.31", "term_ru": "реляционная модель данных", "term_en": "relational model", "definition": "Модель данных (3.1.10), структура которой основана на реляционных отношениях. [ИСО/МЭК 2382:2015, 2121469]", "raw_entry_start": "3.1.31 реляционная модель данных (relational model): Модель данных (3.1.10), структура кото-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.32", "term_ru": "распределение", "term_en": "scatter", "definition": "Распределение обработки по нескольким узлам в кластере (3.1.4). П р и м е ч а н и е — См. распределение—сборка (3.2.33)1).", "raw_entry_start": "3.1.32 распределение (scatter): Распределение обработки по нескольким узлам в кластере (3.1.4)."}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.33", "term_ru": "распределение—сборка", "term_en": "scatter-gather", "definition": "Вид обработки больших массивов данных (3.1.11), при которой необходимые вычисления разделяются и распределяются по нескольким узлам в кластере, а общий результат формируется путем объединения результатов от каждого узла. П р и м е ч а н и е — Обработка методом распределения—сборки обычно требует алгоритмического изменения обрабатывающего программного обеспечения. Примером обработки данных методом распределения—сборки является MapReduce.", "raw_entry_start": "3.1.33 распределение—сборка (scatter-gather): Вид обработки больших массивов данных"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.34", "term_ru": "потоковые данные", "term_en": "streaming data", "definition": "Данные (3.1.5), передаваемые через интерфейс от непрерывно работающего источника. [ИСО/МЭК 19784-4:2011, 4.4]", "raw_entry_start": "3.1.34 потоковые данные (streaming data): Данные (3.1.5), передаваемые через интерфейс от"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.35", "term_ru": "структурированные данные", "term_en": "structured data", "definition": "Данные (3.1.5), организованные на основе предопределенного (применимого) набора правил. П р и м е ч а н и я 1 Предопределенный набор правил, регулирующих основу для структурирования данных, должен быть четко изложен и опубликован. 2 Предопределенная модель данных часто используется для управления структурированием данных.", "raw_entry_start": "3.1.35 структурированные данные (structured data): Данные (3.1.5), организованные на основе"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.36", "term_ru": "SQL", "term_en": null, "definition": "Язык баз данных, описанный в ИСО/МЭК 9075. П р и м е ч а н и е — Аббревиатура SQL иногда расшифровывается как «язык структурированных запросов» (Structured Query Language), но это название не используется в серии стандартов ИСО/МЭК 9075.", "raw_entry_start": "3.1.36 SQL: Язык баз данных, описанный в ИСО/МЭК 9075."}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.37", "term_ru": "неструктурированные данные", "term_en": "unstructured data", "definition": "Данные (3.1.5), характеризуемые отсутствием какой-либо структуры, кроме структуры на уровне записи или файла. П р и м е ч а н и я 1 В целом неструктурированные данные не состоят из элементов данных. 2 Примером неструктурированных данных является произвольный текст.", "raw_entry_start": "3.1.37 неструктурированные данные (unstructured data): Данные (3.1.5), характеризуемые от-"}
{"standard_id": "", "source_file": "gost-r-iso-iec-20546-2021.pdf", "article": "3.1.38", "term_ru": "вертикальное масштабирование", "term_en": "vertical scaling", "definition": "Повышение производительности обработки данных за счет улучшения характеристик процессоров, памяти, хранения или коннективности. П р и м е ч а н и е — Вертикальное масштабирование для увеличения производительности также называется масштабированием ввысь (scale-up). 1) Согласно оригиналу. ФЕДЕРАЛЬНОЕ АГЕНТСТВО ПО ТЕХНИЧЕСКОМУ РЕГУЛИРОВАНИЮ И МЕТРОЛОГИИ ФГБУ «Институт стандартизации» – Федеральный информационный фонд стандартов для Федерального агентства по техническому регулированию и метрологии» ГОСТ Р ИСО/МЭК 20546—2021", "raw_entry_start": "3.1.38 вертикальное масштабирование (vertical scaling): Повышение производительности об-"}
