{"number": 4, "term_ru": "Настоящий стандарт разработан с учетом основных нормативных положений международного документа ISO/TR 9241-810", "term_en": null, "definition": "2020 «Эргономика. Эргономика взаимодействия человек-система. Часть 810. Факторы взаимодействия человек-система роботизированных, интеллектуальных и автономных систем» (ISO/TR 9241-810:2020 «Ergonomics of human-system interaction — Part 810: Robotic, intelligent and autonomous systems», NEQ)\n5 ВВЕДЕН ВПЕРВЫЕ\nПравила применения настоящего стандарта и проведения его мониторинга установлены в ГОСТ Р 1.16—2011 (разделы 5 и 6).\nФедеральное агентство по техническому регулированию и метрологии собирает сведения о практическом применении настоящего стандарта. Данные сведения, а также замечания и предложения по содержанию стандарта можно направлять не позднее чем за 4 мес до истечения срока его действия разработчику настоящего стандарта по адресу: и/или в Федеральное агентство по техническому регулированию и метрологии по адресу: 123112 Москва, Пресненская набережная, дом 10, стр. 2.\nВ случае отмены настоящего стандарта соответствующая информация будет опубликована в ежемесячном информационном указателе «Национальные стандарты» и также будет размещена на официальном сайте Федерального агентства по техническому регулированию и метрологии в сети Интернет (www.rst-gov.ru)\n© Оформление. ФГБУ «Институт стандартизации», 2024\nНастоящий стандарт не может быть полностью или частично воспроизведен, тиражирован и распространен в качестве официального издания без разрешения Федерального агентства по техническому регулированию и метрологии\nСодержание\n1 Область применения 1\n2 Нормативные ссылки 1\n3 Термины и определения 2\nАлфавитный указатель терминов на русском языке 19\nАлфавитный указатель эквивалентов терминов на английском языке 23\nВведение\nУстановленные в настоящем стандарте термины расположены в систематизированном порядке, отражающем систему понятий данной области знания.\nДля каждого понятия установлен один стандартизованный термин. Применение терминов-синонимов стандартизованного термина не допускается.\nЗаключенная в круглые скобки часть термина может быть опущена при использовании термина в документах по стандартизации.\nВ алфавитном указателе данные термины приведены отдельно с указанием номера статьи.\nПриведенные определения можно, при необходимости, изменять, вводя в них производные признаки, раскрывая значения используемых в них терминов, указывая объекты, входящие в объем определяемого понятия. Изменения не должны нарушать объем и содержание понятий, определенных в данном стандарте.\nВ стандарте приведены иноязычные эквиваленты стандартизованных терминов на английском (en) языке.\nСтандартизованные термины набраны полужирным шрифтом, их краткие формы, представленные аббревиатурой, светлым.\nПРЕДВАРИТЕЛЬНЫЙ НАЦИОНАЛЬНЫЙ СТАНДАРТ РОССИЙСКОЙ ФЕДЕРАЦИИ\nСистемы искусственного интеллекта\nТЕХНОЛОГИИ КОГНИТИВНЫЕ ИНФОРМАЦИОННЫЕ\nТермины и определения\nArtificial intelligence systems.\nCognitive information technologies.\nTerms and definitions\nСрок действия с 202_ __\nдо 202_ __\nОбласть применения\nНастоящий стандарт устанавливает термины и определения понятий в области когнитивных информационных технологий.\nТермины, установленные настоящим стандартом, рекомендуются для применения во всех видах документации и литературы по когнитивным информационным технологиям, входящих в сферу действия работ по стандартизации и/или использующих результаты этих работ.\nНормативные ссылки\nВ настоящем стандарте использована нормативная ссылка на следующий стандарт:\nГОСТ Р 57700.37 Компьютерные модели и моделирование. Цифровые двойники изделий. Общие положения.\nП р и м е ч а н и е – При пользовании настоящим стандартом целесообразно проверить действие ссылочных стандартов в информационной системе общего пользования – на официальном сайте Федерального агентства по техническому регулированию и метрологии в сети Интернет или по ежегодному информационному указателю «Национальные стандарты», который опубликован по состоянию на 1 января текущего года, и по выпускам ежемесячного информационного указателя «Национальные стандарты» за текущий год. Если заменен ссылочный стандарт, на который дана недатированная ссылка, то рекомендуется использовать действующую версию этого стандарта с учетом всех внесенных в данную версию изменений. Если заменен ссылочный стандарт, на который дана датированная ссылка, то рекомендуется использовать версию этого стандарта с указанным выше годом утверждения (принятия). Если после утверждения настоящего стандарта в ссылочный стандарт, на который дана датированная ссылка, внесено изменение, затрагивающее положение, на которое дана ссылка, то это положение рекомендуется применять без учета данного изменения. Если ссылочный стандарт отменен без замены, то положение, в котором дана ссылка на него, рекомендуется применять в части, не затрагивающей эту ссылку.\nТермины и определения\nИнформационные системы", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 1, "term_ru": "информация", "term_en": "information", "definition": "Совокупность каких-либо сигнальных воздействий [чувственного, чувственно-содержательного (перцептивно-семантического) восприятия] на субъект.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 2, "term_ru": "данные", "term_en": "data", "definition": "Предоставление информации в формальном виде, пригодном для передачи, интерпретации или обработки людьми или компьютерами. [ГОСТ 33707—2016, статья 4.259]", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 3, "term_ru": "обработка информации (данных)", "term_en": "information processing", "definition": "Совокупность операций, связанных с хранением, поиском, анализом, оценкой, воспроизведением информации с целью представления ее в виде данных, удобных для использования потребителями. [ГОСТ 33707—2016, статья 4.792]", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 4, "term_ru": "средство обработки данных", "term_en": "data processing tool", "definition": "Совокупность технических средств, программного и другого обеспечения, предназначенных для выполнения операций над данными с целью обработки содержащейся в них информации.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 5, "term_ru": "информационная технология; ИТ (information technology, IT)", "term_en": null, "definition": "Приемы, способы и методы применения средств вычислительной техники при выполнении функций сбора, хранения, обработки, передачи и использования данных. [ГОСТ Р 59853—2021, статья 24]", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 6, "term_ru": "информационная система", "term_en": "information system", "definition": "Система, которая организует хранение и манипулирование информацией о предметной области.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 7, "term_ru": "пользователь информационной системы", "term_en": "information system user", "definition": "Лицо (группа лиц, организация), пользующееся услугами информационной системы для получения информации или решения других задач.\nИнтеллектуальная и когнитивная деятельность", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 8, "term_ru": "мышление", "term_en": "thinking", "definition": "Психофизиологические процессы работы мозга субъекта, в том числе относящиеся к внутренней речи, памяти, функциональным психическим чувственным состояниям, обеспечивающие осуществление мыслительной деятельности с инициированием естественно-интеллектуализированных, гибридно-интеллектуализированных, искусственно-интеллектуализированных человеко-информационных взаимодействий, влияющих на возникновение и функционирование информационно-обменных процессов, проведение соответствующей им информационно-интеллектуальной деятельности.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 9, "term_ru": "рефлексия", "term_en": "reflection", "definition": "Процесс отслеживания и переосмысления субъектом информации о собственной активности во взаимодействии с окружающей средой, в том числе результатов мышления и принятых решений, а также способность субъекта к осуществлению такого процесса.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 10, "term_ru": "интеллект", "term_en": "intelligence", "definition": "Способность субъекта к отвлеченному мышлению, абстрагированию, позволяющая с возникновением самосознания и рефлексии использовать имеющуюся у него информацию полезным целенаправленным образом.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 11, "term_ru": "естественный интеллект", "term_en": "natural intelligence", "definition": "Интеллект, носителем которого является биологический субъект.\nП р и м е ч а н и е – Данный термин преимущественно применяется к интеллекту человека, но не исключает представителей царства животных, способных модифицировать свое инстинктивное поведение (инстинкты) полученным в течение жизни опытом.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 12, "term_ru": "интеллектуальная деятельность", "term_en": "intellectual activity", "definition": "Деятельность биологического субъекта по целенаправленному использованию его интеллекта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 13, "term_ru": "искусственный интеллект; ИИ (artificial intelligence, AI)", "term_en": null, "definition": "Комплекс технологических решений, позволяющий имитировать когнитивные функции человека) (включая самообучение, поиск решений без заранее заданного алгоритма и достижение инсайта) и получать при выполнении конкретных практически значимых задач обработки данных результаты, сопоставимые, как минимум, с результатами интеллектуальной деятельности человека. П р и м е ч а н и я: 1. Комплекс технологических решений включает в себя информационно-коммуникационную инфраструктуру, программное обеспечение (в том числе такое, в котором используются методы машинного обучения), процессы и сервисы по обработке данных, анализу и синтезу решений. 2. К когнитивным функциям относятся восприятие, память, речь, внимание, способность суждения, способность планирования и управления. Когнитивные функции выступают основой реализации процессов познания, обучения, принятия решений.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 14, "term_ru": "знания (в искусственном интеллекте)", "term_en": "knowledge", "definition": "Совокупность фактов, событий, убеждений, а также правил, организованных для систематического применения. [ГОСТ 33707—2016, статья 4.398]", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 15, "term_ru": "познание", "term_en": "cognition", "definition": "Процесс получения и преобразования знаний субъектом посредством мышления на основании накапливаемого опыта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 16, "term_ru": "дополненный (естественный) интеллект [augmented (natural) intelligence]", "term_en": null, "definition": "Система, объединяющая естественный интеллект и дополняющие его внешние средства обработки данных, используемые им для реализации процесса познания.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 17, "term_ru": "усиленный (естественный) интеллект [amplified (natural) intelligence]", "term_en": null, "definition": "Система, объединяющая естественный интеллект и усиливающие его внешние средства обработки данных, используемые им для повышения эффективности процесса познания.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 18, "term_ru": "сильный искусственный интеллект", "term_en": "strong artificial intelligence", "definition": "Тип искусственного интеллекта, который способен выполнять различные задачи, взаимодействовать с человеком и самостоятельно (без участия человека) адаптироваться к изменяющимся условиям.\nП р и м е ч а н и е – Сильный искусственный интеллект ориентирован на воспроизведение высших когнитивных функций человека (включая рефлексию и абстрактное мышление) при решении творческих задач, связанных с извлечением и оперированием смыслами для широкого класса приложений.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 19, "term_ru": "общий искусственный интеллект", "term_en": "artificial general intelligence", "definition": "Философский концепт, определяющий когнитивного агента общего назначения, способного выполнить произвольную задачу на уровне, сопоставимом с человеком или превосходящем его.\nП р и м е ч а н и е – Общий искусственный интеллект является философским понятием, а сильный искусственный интеллект определяет класс технологий, которые могут быть реализованы на текущем уровне развития науки и техники.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 20, "term_ru": "когнитивная деятельность", "term_en": "cognitive activity", "definition": "Интеллектуальная деятельность, направленная на реализацию процесса познания.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 21, "term_ru": "когнитивные способности", "term_en": "cognitive abilities", "definition": "Интеллектуальные способности, позволяющие субъекту осуществлять процесс познания.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 22, "term_ru": "киберпространство", "term_en": "cyberspace", "definition": "Абстрактная цифровая сущность, включающая в себя совокупность сведений об объектах, субъектах и системах реального мира, а также связях между ними, зафиксированных цифровыми средствами сбора и обработки данных.\nП р и м е ч а н и е – Киберпространство всегда связано с сущностями реального мира. Потому многопользовательские компьютерные игры, социальные медиа и цифровые двойники образуют киберпространства, а классические системы компьютерного моделирования – нет.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 23, "term_ru": "метакогнитивность", "term_en": "metacognitivity", "definition": "Способность субъекта осуществлять рефлексию процесса получения и преобразования знаний.\nКогнитивные информационные технологии и системы", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 24, "term_ru": "когнитивная технология", "term_en": "cognitive technology", "definition": "Совокупность взаимосвязанных методов и средств повышения эффективности когнитивной деятельности субъекта.\nП р и м е ч а н и е – Примером когнитивной технологии является технология биплотов для проверки соответствия выборочного распределения определенному закону. В данном случае средствами являются бумага, карандаш и линейка, а метод заключается в правилах нанесения на графике точек, соответствующих квантилям распределения, с последующей визуальной оценкой степени их отклонения от биссектрисы координатного узла. Повышение эффективности когнитивной деятельности обеспечивается тем, что путем визуального анализа биплотов (отклонений от прямой линии) специалист может более достоверно сделать выводы о соответствии выборке классу распределений, чем просто путем сопоставления графиков плотностей распределений. Эта когнитивная технология может быть реализована без применения информационных технологий.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 25, "term_ru": "когнитивная информационная технология; КИТ (cognitive information technology, CIT)", "term_en": null, "definition": "Когнитивная технология, реализуемая посредством информационной технологии.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 26, "term_ru": "метакогнитивная информационная технология", "term_en": "metacognitive information technology", "definition": "Когнитивная информационная технология, реализованная в форме технологии, воспроизводящей метакогнитивные свойства мышления субъекта посредством технологий искусственного интеллекта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 27, "term_ru": "когнитивная информационная система; КИС (cognitive information system, CIS)", "term_en": null, "definition": "Система, организующая хранение и манипулирование информацией о предметной области, предназначенная для повышения эффективности процесса познания ее пользователя за счет применения когнитивных информационных технологий.\nП р и м е ч а н и е – Когнитивная информационная система может быть использована в качестве внешнего средства обработки данных в системе усиленного (естественного) интеллекта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 28, "term_ru": "когнитивная архитектура", "term_en": "cognitive architecture", "definition": "Концептуальная структура информационной системы, формализующая процессы когнитивной деятельности.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 29, "term_ru": "цифровой ассистент", "term_en": "digital assistant", "definition": "Информационная система, представляющая в совокупности с ее пользователем дополненный и/или усиленный (естественный) интеллект для задач информационной и/или интеллектуальной поддержки принятия решений.\nП р и м е ч а н и е – Информационная поддержка принятия решений осуществляется путем предоставления пользователю актуальных сведений о текущей ситуации, в то время как интеллектуальная поддержка принятия решений основывается на рекомендациях, сценариях или иных описаниях вариантов решений, созданных на актуальных сведениях с помощью технологий искусственного интеллекта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 30, "term_ru": "рекомендательная система", "term_en": "recommender system", "definition": "Информационная система, направленная на осуществление выбора и ранжирования объектов или решений, в том числе, в интересах пользователя.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 31, "term_ru": "распределенная когнитивная информационная система; распределенная КИС", "term_en": "distributed CIS", "definition": "Многопользовательская когнитивная информационная система, обеспечивающая процессы совместной когнитивной деятельности нескольких пользователей и систем искусственного интеллекта, распределенных во времени и/или в пространстве.\nП р и м е ч а н и е – Примером распределенной когнитивной информационной системы может быть многопользовательская рекомендательная система, алгоритм работы которой динамически учитывает обобщенный пользовательский опыт. Например, для ранжирования товаров и услуг на основе текущих отзывов и комментариев в социальных сетях.\nОсновные элементы когнитивных информационных систем", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 32, "term_ru": "пользователь когнитивной информационной системы; пользователь КИС", "term_en": "CIS user", "definition": "Человек, взаимодействующий с когнитивной информационной системой с целью повышения эффективности своей когнитивной деятельности.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 33, "term_ru": "ценности пользователя когнитивной информационной системы; ценности пользователя КИС", "term_en": "values of CIS user", "definition": "Набор субъективных характеристик целеполагания пользователя когнитивной информационной системы, которые определяют характер, сценарии, цели использования когнитивной информационной системы в долгосрочной перспективе.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 34, "term_ru": "цифровая личность пользователя когнитивной информационной системы; цифровая личность пользователя КИС", "term_en": "digital identity of CIS user", "definition": "Совокупность данных и моделей, описывающих когнитивные и иные характеристики пользователя когнитивной информационной системы, а также система двусторонних связей между ними и пользователем.\nП р и м е ч а н и е – Цифровая личность является вариантом цифрового двойника (см. ГОСТ Р 57700.37, статья 3.24), что требует обязательного наличия системы двусторонних связей между ней и пользователем.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 35, "term_ru": "прототип", "term_en": "prototype", "definition": "Исходный объект или субъект реального мира, по отношению к которому пользователь когнитивной информационной системы осуществляет когнитивную деятельность посредством когнитивных информационных технологий.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 36, "term_ru": "цифровой профиль", "term_en": "digital profile", "definition": "Набор данных киберпространства, ассоциированных с прототипом и доступных для анализа посредством когнитивной информационной системы.\nП р и м е ч а н и е – Цифровой профиль может рассматриваться как часть цифровой личности (например, для аватара пользователя в киберпространстве) или независимо (например, при разовой регистрации пользователя в социальном медиа).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 37, "term_ru": "номенклатура данных цифрового профиля", "term_en": "digital profile data nomenclature", "definition": "Перечень наименований наборов данных цифрового профиля, отображающих различные характеристики прототипа.\nП р и м е ч а н и е – В цифровой профиль могут входить как структурированные, так и неструктурированные данные (например, фотография пользователя или описание его интересов).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 38, "term_ru": "динамический цифровой профиль", "term_en": "dynamical digital profile", "definition": "Цифровой профиль, содержащий данные одинаковой номенклатуры, зафиксированные средствами сбора и обработки данных в различные моменты времени.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 39, "term_ru": "цифровой образ", "term_en": "digital entity", "definition": "Отображение прототипа в когнитивной информационной системе в форме совокупности моделей, данных и системы двусторонних связей, являющееся инструментом познания для пользователя когнитивной информационной системы.\nП р и м е ч а н и е – Цифровой образ не может быть в полной мере сведен понятию цифрового двойника (см. ГОСТ Р 57700.37), поскольку относится как к объектам (в т. ч. открытым системам, определяющим среду), так и субъектам.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 40, "term_ru": "функциональный цифровой образ", "term_en": "functional digital entity", "definition": "Цифровой образ, позволяющий воспроизводить функциональные характеристики прототипа в когнитивной информационной системе посредством математического моделирования.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 41, "term_ru": "дескриптивный цифровой образ", "term_en": "descriptive digital entity", "definition": "Цифровой образ, позволяющий извлекать знания о прототипе в когнитивной информационной системе на основе обработки данных его цифрового профиля.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 42, "term_ru": "нормативный цифровой образ", "term_en": "normative digital entity", "definition": "Цифровой образ, позволяющий определять характеристики цифрового профиля или окружения, обеспечивающие заданные свойства прототипа в когнитивной информационной системе.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 43, "term_ru": "окружение когнитивной информационной системы; окружение КИС", "term_en": "CIS environment", "definition": "Совокупность цифровых образов прототипов, содержащихся в когнитивной информационной системе.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 44, "term_ru": "база данных когнитивной информационной системы; база данных КИС", "term_en": "CIS database", "definition": "Набор цифровых профилей прототипов, а также иных данных, доступных для анализа посредством когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 45, "term_ru": "ядро когнитивной информационной системы; ядро КИС", "term_en": "CIS core", "definition": "Информационная система, осуществляющая обработку запросов пользователя когнитивной информационной системы на основе манипулирования цифровыми образами различных прототипов окружения когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 46, "term_ru": "цифровой аватар", "term_en": "digital avatar", "definition": "Цифровой ассистент, реализующий метакогнитивную информационную технологию поддержки принятия решений пользователя когнитивной информационной системы на основе его цифровой личности.\nП р и м е ч а н и е – Цифровой аватар является персональным цифровым ассистентом, интеллектуальные механизмы которого эволюционируют вместе с конкретным пользователем в силу двусторонних связей, обеспечиваемых цифровой личностью. Как правило, цифровые аватары реализуются в форме распределенной когнитивной информационной системы. При этом цифровые аватары могут иметь разные механизмы для взаимодействия с пользователем и обеспечения процесса рефлексии, в т. ч. визуальный 3D-образ, с которым себя ассоциирует пользователь.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 47, "term_ru": "метавселенная", "term_en": "the metaverse", "definition": "Совокупность перманентно существующих виртуальных миров, в которых пользователи могут взаимодействовать друг с другом и воспроизводить действия, характерные для реального мира, с помощью цифровых образов.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 48, "term_ru": "виртуальный мир", "term_en": "virtual world", "definition": "Киберпространство, конструируемое создателями метавселенной, имеющее определенную тему, управляемое на основе заданных закономерностей и правил, взаимодействие пользователей метавселенной в которых осуществляется посредством цифровых аватаров.\nП р и м е ч а н и е – Виртуальный мир отличается от киберпространства тем, что в нем дополнительно устанавливаются закономерности и правила, которые отсутствуют в реальном мире. За счет варьирования ими достигается множественность виртуальных миров при одних и тех же прототипах реального мира.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 49, "term_ru": "создатель метавселенной", "term_en": "metaverse creator", "definition": "Лицо (группа лиц), конструирующее виртуальные миры, задающее закономерности и правила их функционирования, разрабатывающее механизмы взаимодействия пользователей в метавселенной, а также несущее ответственность за результаты использования метавселенной.\nП р и м е ч а н и е – Несмотря на то, что виртуальные миры могут быть сконструированы посредством технологий искусственного интеллекта, путем генеративного дизайна, сам искусственный интеллект не может считаться их создателем в силу положений этики искусственного интеллекта, определяющих отсутствие его полной правосубъектности (а, значит, ответственности за результат).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 50, "term_ru": "пользователь метавселенной", "term_en": "metaverse user", "definition": "Лицо (группа лиц), использующее возможности метавселенной, взаимодействуя с виртуальными мирами посредством цифрового аватара.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 51, "term_ru": "средства исполнения когнитивной информационной системы; средства исполнения КИС", "term_en": "CIS inference engine", "definition": "Совокупность средств преобразования данных и знаний, обеспечивающая функционирование ядра когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 52, "term_ru": "база знаний когнитивной информационной системы; база знаний КИС", "term_en": "CIS knowledge base", "definition": "Организованная совокупность знаний, используемых ядром когнитивной информационной системы, включая знания, входящие в состав цифровых личностей пользователей когнитивной информационной системы.\nП р и м е ч а н и е – База знаний когнитивной информационной системы может быть как централизованной, так и распределенной; в последнем случае знания могут физических размещаться на собственных терминальных устройствах пользователей когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 53, "term_ru": "вычислительная инфраструктура когнитивной информационной системы; вычислительная инфраструктура КИС", "term_en": "CIS computational infrastructure", "definition": "Набор средств обработки данных, используемый для организации сбора, хранения, обработки, передачи и использования данных в составе когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 54, "term_ru": "интерфейс когнитивной информационной системы; интерфейс КИС", "term_en": "CIS interface", "definition": "Совокупность средств и правил, обеспечивающих взаимодействие пользователя и когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 55, "term_ru": "входной интерфейс когнитивной информационной системы; входной интерфейс КИС", "term_en": "CIS input interface", "definition": "Интерфейс когнитивной информационной системы, обеспечивающий поступление информации от пользователя к когнитивной информационной системе.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 56, "term_ru": "выходной интерфейс когнитивной информационной системы; выходной интерфейс КИС", "term_en": "CIS output interface", "definition": "Интерфейс когнитивной информационной системы, обеспечивающий поступление информации от когнитивной информационной системы к пользователю.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 57, "term_ru": "мультимодальный интерфейс когнитивной информационной системы; мультимодальный интерфейс КИС", "term_en": "multimodal CIS interface", "definition": "Интерфейс когнитивной информационной системы, одновременно использующий несколько средств обработки разнородной информации, передаваемой пользователем когнитивной информационной системы по различным каналам коммуникации (речевой, текстовый, аудиальный, визуальный, тактильный и так далее).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 58, "term_ru": "омниканальный интерфейс когнитивной информационной системы; омниканальный интерфейс КИС", "term_en": "omnichannel CIS interface", "definition": "Мультимодальный интерфейс когнитивной информационной системы, обеспечивающий взаимную интеграцию разрозненных каналов коммуникации в один канал, интерпретируемый пользователем.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 59, "term_ru": "адаптивный интерфейс когнитивной информационной системы; адаптивный интерфейс КИС", "term_en": "CIS adaptive interface", "definition": "Интерфейс КИС, позволяющий формировать способ запроса или предоставлять информацию пользователю когнитивной информационной системы с учетом его индивидуальных особенностей в целях повышения эффективности когнитивных функций когнитивной информационной системы.\nСвойства и характеристики когнитивных информационных систем", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 60, "term_ru": "когнитивные функции когнитивной информационной системы; когнитивные функции КИС", "term_en": "CIS cognitive functions", "definition": "Набор процессов когнитивной деятельности пользователя когнитивной информационной системы, эффективность которых повышается при применении когнитивной информационной системы для манипулирования данными предметной области, а также для поддержки принятия решений.\nП р и м е ч а н и е – К процессам когнитивной деятельности относятся, например, собственно познание, обучение, принятие решений.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 61, "term_ru": "задачи когнитивной информационной системы; задачи КИС", "term_en": "CIS goals", "definition": "Набор задач познания, решаемых пользователем для получения новых знаний о прототипе посредством манипулирования его цифровым образом в когнитивной информационной системе.\nП р и м е ч а н и е – К задачам познания относятся, например, диагностика (описание), объяснение, предсказание, мониторинг, управление.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 62, "term_ru": "критерии эффективности когнитивной информационной системы; критерии эффективности КИС", "term_en": "CIS efficiency criteria", "definition": "Количественные характеристики, отражающие качество реализации когнитивных функций когнитивной информационной системы при ее использовании пользователем для решения задач когнитивной информационной системы.\nП р и м е ч а н и е – Критерии эффективности когнитивной информационной системы могут строиться на метриках качества моделей машинного обучения, используемых при решении задач когнитивной информационной системы. Например, точность и полнота, определяемые через вероятности рекомендаций, принятых и не принятых пользователем когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 63, "term_ru": "модальность интерфейса когнитивной информационной системы; модальность интерфейса КИС", "term_en": "modality of CIS interface", "definition": "Физически регистрируемый элемент коммуникации (человеко-машинной и/или межличностной), включающий как собственно передаваемую информацию (сообщение), так и информацию о самом субъекте (например, о его состоянии, отношении к сообщению, собеседнику, коммуникации и так далее).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 64, "term_ru": "адаптивность когнитивной информационной системы; адаптивность КИС", "term_en": "CIS adaptivity", "definition": "Свойство когнитивной информационной системы, определяющее возможность изменения ее интерфейсов, моделей и иных механизмов для повышения эффективности когнитивной информационной системы при изменении условий использования, в том числе, различными пользователями.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 65, "term_ru": "интроспекция в когнитивной информационной системе; интроспекция в КИС", "term_en": "introspection in CIS", "definition": "Когнитивная деятельность пользователя когнитивной информационной системы для случая, когда пользователь одновременно является прототипом цифрового образа.\nП р и м е ч а н и е – Примерами интроспекции в когнитивной информационной системе являются, например, персональные ассистенты для контроля физического и психофизиологического состояния человека.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 66, "term_ru": "контролируемость когнитивной информационной системы; контролируемость КИС", "term_en": "CIS supervisability", "definition": "Свойство когнитивной информационной системы, обеспечивающее возможность наблюдения за поведением когнитивной информационной системы и последующего контроля над ее действиями с целью оптимизации функционирования когнитивной информационной системы.\nП р и м е ч а н и е – Контролируемость когнитивной информационной системы может быть полной и частичной. Полная контролируемость характерна для оператора когнитивной информационной системы (например, создателя метавселенной): она обеспечивает наблюдаемость всех процессов и возможность управления ими как напрямую, так и через функции самой когнитивной информационной системы. Частичная контролируемость характерна для пользователя когнитивной информационной системы: он может наблюдать только процессы своего окружения, а управлять ими только посредством доступным ему функций когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 67, "term_ru": "управляемость когнитивной информационной системы; управляемость КИС", "term_en": "CIS controllability", "definition": "Свойство когнитивной информационной системы, обеспечивающее возможность целенаправленного воздействия на окружение когнитивной информационной системы для достижения заданного режима ее функционирования.\nП р и м е ч а н и е – Управление когнитивной информационной системой может быть прямым (через императивное изменение условий работы средств исполнения когнитивной информационной системы), так и косвенным, воздействуя на свойства цифровых личности конкретных пользователей через коммуникации. В обоих случаях управляемость когнитивной информационной системы не может быть гарантирована. Так, прямое изменение режима работы средств исполнения может нанести критический ущерб действиям пользователей (например, разрушения игрового процесса и достижений). А косвенное управление не эффективно в ситуациях, связанных с фазовыми переходами в социальных сетях (массовое распространение информации из разных источников одновременно).", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 68, "term_ru": "обучение когнитивной информационной системы; обучение КИС", "term_en": "CIS learning", "definition": "Процесс целенаправленного предоставления информации от пользователя к когнитивной информационной системе, в рамках которого когнитивная информационная система улучшает свои характеристики путем приобретения новых знаний и/или опыта или путем реорганизации существующих знаний и/или опыта за счет обработки информации в ядре когнитивной информационной системы с помощью технологий искусственного интеллекта.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 69, "term_ru": "самообучение когнитивной информационной системы; самообучение КИС", "term_en": "CIS self-learning", "definition": "Процесс обучения когнитивной информационной системы, в рамках которого когнитивная информационная система улучшает свои характеристики в ходе эксплуатации по мере накопления опыта взаимодействия с пользователями когнитивной информационной системы.", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 70, "term_ru": "метаобучение когнитивной информационной системы; метаобучение КИС", "term_en": "CIS meta-learning", "definition": "Процесс самообучения когнитивной информационной системы, в рамках которого когнитивная информационная система выбирает приемы, методы, способы и инструменты, повышающие эффективность самообучения когнитивной информационной системы.\nП р и м е ч а н и е – Метаобучение когнитивной информационной системы может быть реализовано за счет использования технологий автоматического машинного обучения, в т. ч. автоматического построения моделей на данных одной или группы цифровых личностей или автоматического тематического моделирования, настраивающегося на глоссарий, характерный для группы цифровых личностей. Кроме того, для организации метаобучения могут быть использованы интерактивные средства работы с пользователями когнитивной информационной системы (например, дополнительные запросы в условиях высокой неопределенности).\n57 Алфавитный указатель терминов на русском языке\nаватар цифровой\nадаптивность КИС\nадаптивность когнитивной информационной системы\nархитектура когнитивная\nассистент цифровой\nбаза данных КИС\nбаза данных системы информационной когнитивной\nбаза знаний КИС\nбаза знаний системы информационной когнитивной\nданные\nдеятельность интеллектуальная\nдеятельность когнитивная\nзадачи КИС\nзадачи системы информационной когнитивной\nзнания (в искусственном интеллекте)\nИИ\nинтеллект\nинтеллект дополненный (естественный)\nинтеллект естественный\nинтеллект искусственный\nинтеллект искусственный общий\nинтеллект искусственный сильный\nинтеллект усиленный (естественный)\nинтерфейс КИС\nинтерфейс КИС адаптивный\nинтерфейс КИС входной\nинтерфейс КИС выходной\nинтерфейс КИС мультимодальный\nинтерфейс КИС омниканальный\nинтерфейс системы информационной когнитивной\nинтерфейс системы информационной когнитивной адаптивный\nинтерфейс системы информационной когнитивной входной\nинтерфейс системы информационной когнитивной выходной\nинтерфейс системы информационной когнитивной мультимодальный\nинтерфейс системы информационной когнитивной омниканальный\nинтроспекция в КИС\nинтроспекция в системе информационной когнитивной\nинформация\nинфраструктура КИС вычислительная\nинфраструктура системы информационной когнитивной вычислительная\nИТ\nкиберпространство\nКИС\nКИС распределенная\nКИТ\nконтролируемость КИС\nконтролируемость системы информационной когнитивной\nкритерии эффективности КИС\nкритерии эффективности системы информационной когнитивной\nличность пользователя КИС цифровая\nличность пользователя системы информационной когнитивной цифровая\nметавселенная\nметакогнитивность\nметаобучение КИС\nметаобучение системы информационной когнитивной\nмир виртуальный\nмодальность интерфейса КИС\nмодальность интерфейса системы информационной когнитивной\nмышление\nноменклатура данных профиля цифрового\nобработка информации (данных)\nобраз цифровой\nобраз цифровой дескриптивный\nобраз цифровой нормативный\nобраз цифровой функциональный\nобучение КИС\nобучение системы информационной когнитивной\nокружение КИС\nокружение системы информационной когнитивной\nпознание\nпользователь КИС\nпользователь метавселенной\nпользователь системы информационной\nпользователь системы информационной когнитивной\nпрототип\nпрофиль цифровой\nпрофиль цифровой динамический\nрефлексия\nсамообучение КИС\nсамообучение системы информационной когнитивной\nсистема информационная\nсистема информационная когнитивная\nсистема информационная когнитивная распределенная\nсистема рекомендательная\nсоздатель метавселенной\nспособности когнитивные\nсредства исполнения КИС\nсредства исполнения системы информационной когнитивной\nсредство обработки данных\nтехнология информационная\nтехнология информационная когнитивная\nтехнология информационная метакогнитивная\nтехнология когнитивная\nуправляемость КИС\nуправляемость когнитивной информационной системы\nфункции КИС когнитивные\nфункции системы информационной когнитивной когнитивные\nценности пользователя КИС\nценности пользователя системы информационной когнитивной\nядро КИС\nядро системы информационной когнитивной\n58 Алфавитный указатель эквивалентов терминов на английском языке\namplified (natural) intelligence\nartificial general intelligence\nartificial intelligence\naugmented (natural) intelligence\nCIS adaptive interface\nCIS adaptivity\nCIS cognitive functions\nCIS computational infrastructure\nCIS controllability\nCIS core\nCIS database\nCIS efficiency criteria\nCIS environment\nCIS goals\nCIS inference engine\nCIS input interface\nCIS interface\nCIS knowledge base\nCIS learning\nCIS meta-learning\nCIS output interface\nCIS self-learning\nCIS supervisability\nCIS user\ncognition\ncognitive abilities\ncognitive activity\ncognitive architecture\ncognitive information system\ncognitive information technology\ncognitive technology\ncyberspace\ndata processing tool\ndata\ndescriptive digital entity\ndigital assistant\ndigital avatar\ndigital entity\ndigital identity of CIS user\ndigital profile data nomenclature\ndigital profile\ndistributed CIS\ndynamical digital profile\nfunctional digital entity\ninformation processing\ninformation system user\ninformation system\ninformation technology\ninformation\nintellectual activity\nintelligence\nintrospection in CIS\nknowledge\nmetacognitive information technology\nmetacognitivity\nmetaverse creator\nmetaverse user\nmodality of CIS interface\nmultimodal CIS interface\nnatural intelligence\nnormative digital entity\nomnichannel CIS interface\nprototype\nrecommender system\nreflection\nstrong artificial intelligence\nthe metaverse\nthinking\nvalues of CIS user\nvirtual world", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
{"number": 48, "term_ru": "УДК 004.81", "term_en": null, "definition": "006.354\nОКС 35.020\nКлючевые слова: когнитивные технологии, термины, искусственный интеллект\nКлючевые слова: когнитивные технологии, термины, искусственный интеллект\nРуководитель Национального центра когнитивных разработок Университета ИТМО\nРуководитель Национального центра когнитивных разработок Университета ИТМО\nА. В. Бухановский", "source_file": "Проект_ГОСТ_КИТ_на_НК_б.docx"}
