{"number": 1, "term_ru": "система поддержки принятия решений; СППР (Decision Support System; DSS)", "term_en": null, "definition": "Когнитивная информационная система, цель которой оказание помощи лицам, принимающим решение в сложных ситуациях на основе объективного анализа актуальных данных для достижения целей принятия решения с учетом критериев эффективности и возможных ограничений, включая временны́е, на основе заложенных в систему алгоритмов.\nП р и м е ч а н и е – СППР может функционировать как самостоятельная информационная система, так и как подсистема в составе другой автоматизированной системы.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 2, "term_ru": "сложная ситуация для принятия решений", "term_en": "Difficult Situation for Decision Making", "definition": "Ситуация, в которой решение необходимо принимать в условиях неопределенности как минимум при одном из следующих факторов: а) ограниченное время принятия решения; б) объем информации для принятия решения, превышающий когнитивные способности лица, принимающего решение; в) отсутствие информации, необходимой для принятия решения на основе априорного опыта лица, принимающего решение.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 3, "term_ru": "лицо, принимающее решение; ЛПР (Decision Maker, DM)", "term_en": null, "definition": "Субъект решения, наделенный полномочиями в части выбора варианта решения и несущий ответственность за последствия принятого решения, в интересах которого функционирует СППР.\nП р и м е ч а н и е – В качестве ЛПР может выступать один или несколько человек (коллектив), на которых лежит ответственность за принятое решение.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 4, "term_ru": "критерий принятия решений", "term_en": "Decision Making Criteria", "definition": "Условие на основе числового или категориального признака, выражающее степень пригодности конкретного решения для целей ЛПР и позволяющее ранжировать варианты решений, предлагаемых СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 5, "term_ru": "условия принятия решений", "term_en": "Conditions of Decisions Making", "definition": "Совокупные особенности решаемой задачи, критериев принятия решений и входных данных, определяющие возможность применения различного математического аппарата для описания предметной области, в которой принимается решение, и методов достижений целей СППР.\nП р и м е ч а н и е – К ключевым условиям принятия решений относятся множественность критериев, недостаток или избыток информации, а также степень структурированности проблемы (сильная или слабая).", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 6, "term_ru": "цель СППР", "term_en": "DSS Goal", "definition": "Измеримое повышение качества решений, принимаемых ЛПР при использовании СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 7, "term_ru": "функция СППР", "term_en": "DSS Function", "definition": "Совокупность действий СППР, выполняемая на основе заложенных в ней алгоритмов, направленная на оказание информационной помощи ЛПР при решении поставленной задачи.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 8, "term_ru": "алгоритм функционирования СППР", "term_en": "DSS Functioning Algorithm", "definition": "Алгоритм, задающий условия (правила) и действия СППР в ходе обработки входных данных для выработки одного или нескольких альтернативных решений, которые могут способствовать достижению цели ЛПР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 9, "term_ru": "научно-технический уровень СППР; НТУ СППР (Scientific and Technical Level of the DSS, DSS S&TL)", "term_en": null, "definition": "Показатель или совокупность показателей, характеризующих степень соответствия технических и экономических характеристик СППР современным достижениям науки и техники в области обработки данных, математического моделирования, теории принятия решений и технологий искусственного интеллекта.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 10, "term_ru": "персональная СППР", "term_en": "Personal DSS", "definition": "СППР, ориентированная на психофизиологические, интеллектуальные и ценностно-этические особенности конкретного ЛПР, работающего с данной СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 11, "term_ru": "групповая СППР", "term_en": "Group DSS", "definition": "СППР, ориентированная на обслуживание группы лиц, которые взаимодействуют между собой в ходе принятия решения, и способствующая устранению коммуникационных барьеров и противоречий между членами группы в процессе выработки и принятия решений.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 12, "term_ru": "интеллектуальная СППР", "term_en": "Intelligent DSS", "definition": "СППР, использующая в ходе своей работы принципы воспроизведения когнитивной деятельности человека в условиях неопределенности и неполноты данных, реализуемые посредством технологий искусственного интеллекта.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 13, "term_ru": "технология функционирования СППР", "term_en": "DSS Operation Technology", "definition": "Совокупность методов и средств, обеспечивающих обработку данных в ходе подготовки решений с использованием СППР, включающая последовательности типовых операций, используемые подходы, математические методы, модели и алгоритмы, программные системы, а также описание правил их применения.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 14, "term_ru": "приобретение знаний", "term_en": "Knowledge Acquisition", "definition": "Процесс получения знаний, необходимых для работы СППР, включая выявление априорных знаний из различных источников, получение и формализацию новых знаний на основе данных средствами машинного обучения, синтез новых знаний путем агрегации существующих знаний, их преобразование и формализацию для использования при реализации функции СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 15, "term_ru": "архитектура СППР", "term_en": "DSS Architecture", "definition": "Целостная концепция основных свойств СППР, выраженная в форме типовых схем состава и взаимосвязей компонентов или элементов, описания принципов организации системы и взаимодействия ее элементов (компонентов), а также управления ее жизненным циклом.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 16, "term_ru": "неопределенность в принятии решений", "term_en": "Uncertainty in Decision Making", "definition": "Отсутствие или недостаток объективной информации в отношении объекта принятия решений, порождающие необходимость использования дополнительных гипотез при разработке алгоритмов функционирования СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 17, "term_ru": "когнитивная информационная технология; КИТ (Cognitive Information Technology, CIT)", "term_en": null, "definition": "Когнитивная технология, реализуемая посредством информационной технологии.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 18, "term_ru": "когнитивная информационная система; КИС (Cognitive Information System, CIS)", "term_en": null, "definition": "Система, организующая хранение и манипулирование информацией о предметной области и предназначенная для повышения эффективности процесса познания ее пользователя за счет применения.\n6 Основные элементы СППР", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 19, "term_ru": "оператор СППР", "term_en": "DSS Operator", "definition": "Лицо, обеспечивающее ввод, обработку информации и получение результата с использованием СППР в интересах ЛПР.\nП р и м е ч а н и е – Оператор СППР и ЛПР могут быть как разными лицами, так и одним и тем же лицом.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 20, "term_ru": "эксплуатационный персонал СППР", "term_en": "DSS Operating Personnel", "definition": "Группа специалистов, обеспечивающих корректное и непрерывное функционирование СППР как информационной системы, эксплуатацию в течение жизненного цикла, включая обеспечение доступа к внешним источникам данных.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 21, "term_ru": "методическое обеспечение СППР", "term_en": "Methodological Support of DSS", "definition": "Совокупность документально зафиксированных подходов и практик, определяющих технологию функционирования СППР, методы и приемы, обеспечивающие ЛПР помощь в принятии решений в соответствии с установленными критериями.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 22, "term_ru": "математическое обеспечение СППР", "term_en": "Mathematical Support of DSS", "definition": "Совокупность математических методов, моделей и алгоритмов, обеспечивающих выработку решений в интересах ЛПР, адаптированных к специфике установленных критериев и входных данных.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 23, "term_ru": "хранилище CППР", "term_en": "DSS Storage", "definition": "Хранилище, представляющее собой информационную среду хранения и обработки данных определенной структуры, содержащих характеристики задачи, требующей принятия решения.\nП р и м е ч а н и е – В функцию хранилища также входит хранение информации о ранее выполненных запросах ЛПР с целью их анализа для улучшения функционирования СППР в дальнейшем.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 24, "term_ru": "база моделей для поддержки принятия решений", "term_en": "Base of Models for Decision Support", "definition": "Набор моделей, основанных на математической интерпретации задачи, которые при помощи определенных алгоритмов способствуют нахождению одного решения или нескольких оптимальных или субоптимальных альтернатив (вариантов решений), предлагаемых ЛПР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 25, "term_ru": "диалоговый компонент СППР", "term_en": "Dialogue Component of the DSS", "definition": "Совокупность технических решений, обеспечивающих взаимодействие между оператором СППР и ее техническими компонентами с целью обеспечения хода решения задач, процесса приобретения знаний и объяснения результатов работы.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 26, "term_ru": "объяснительный компонент СППР", "term_en": "Explanatory Component of the DSS", "definition": "Компонент СППР, обеспечивающий понимание того, каким образом система получила единственное решение или альтернативные варианты решения задачи и какие знания в ходе этого процесса были использованы.\nП р и м е ч а н и я:\n1 Объяснение подразумевает представление хода получения результата в графической, табличной или текстовой формах, доступных для понимания человеком.\n2 В случае невозможности СППР предоставить как минимум единственное решение для поставленной задачи объяснительный компонент должен предоставить объяснение отсутствия возможности его выработки.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 27, "term_ru": "интерфейс СППР", "term_en": "DSS Interface", "definition": "Совокупность технических средств для ввода данных и отображения вариантов решения задачи.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 28, "term_ru": "база знаний", "term_en": "Knowledge Base", "definition": "Формализованная и систематизированная совокупность взаимосвязанных знаний в предметной области принятия решения.\nП р и м е ч а н и е – База знаний может быть представлена в явном виде (например, на основе продукций или онтологий) или в неявном виде (например, в форме модели машинного обучения, результатом применения которой является решающее правило).", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 29, "term_ru": "правила принятия решения", "term_en": "Decision Rules", "definition": "Набор закономерностей, используемых для представления взаимосвязей между фактами в ходе выработки решения, основанного на знаниях, представленных в формальном машиночитаемом виде.\nП р и м е ч а н и е – Правила принятия решений являются одним из множества формальных подходов, используемых для описания процессов выработки и принятия решений. Правила принятия решений имеют обязательное представление в СППР, если данный подход – ключевой способ обработки входных данных. Однако в ряде случаев, например при использовании в СППР моделей машинного обучения на данных, правила в явном виде могут не задаваться.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 30, "term_ru": "компонент вывода", "term_en": "Inference Component", "definition": "Для СППР, основанных на знаниях, компонент, обеспечивающий преобразование входных данных с использованием базы знаний в итоговые решения в интересах ЛПР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 31, "term_ru": "компонент самообучения", "term_en": "Self-learning Component", "definition": "Компонент обновления базы знаний СППР на основе входных данных и результатов обработки данных, полученных в ходе использования системы.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 32, "term_ru": "компонент валидации результатов вычислений", "term_en": "Computations Results Validation Component", "definition": "Компонент проверки соответствия результатов работы СППР данным, не заложенным в базу знаний в форме заранее известных решений, а также ожиданиям ЛПР в условиях определенности и полноты данных.\n7 Свойства и показатели СППР", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 33, "term_ru": "эффективность СППР", "term_en": "Efficiency of the DSS", "definition": "Интегральное свойство СППР, характеризующее степень достижения целей, поставленных при ее создании, включая степень соответствия пользовательским требованиям и предметно-ориентированные измеримые показатели.\nП р и м е ч а н и е – Эффективность СППР в ряде случаев не может быть формализована в измеримых количественных показателях и может иметь форму качественных оценок.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 34, "term_ru": "качество решений, вырабатываемых СППР", "term_en": "Quality of Solutions Generated by the DSS", "definition": "Степень оптимальности решений, предлагаемых СППР, исходя из критериев апостериорной удовлетворенности ЛПР, оцениваемой в ходе процесса валидации.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 35, "term_ru": "сфокусированность СППР", "term_en": "DSS Focus", "definition": "Показатель эффективности СППР, характеризуемый степенью детализации решений в отношении поставленной задачи.\nП р и м е ч а н и е – Обобщенные и менее детализированные рекомендации, вырабатываемые системой, делают СППР менее эффективной.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 36, "term_ru": "контекст выработки принятия решений", "term_en": "Decision Making Context", "definition": "Совокупность условий и обстоятельств, определяющих решения конкретной задачи, стоящей перед СППР.\nП р и м е ч а н и е – Глубина учета контекста определена количеством формализованных условий и обстоятельств, принимаемых во внимание при выработке решений.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 37, "term_ru": "ситуативность решений", "term_en": "Situationality of Decisions", "definition": "Показатель эффективности СППР, характеризующий глубину учета контекста в конкретной ситуации, в условиях которой вырабатывается решение.\nП р и м е ч а н и е – Более глубокий учет контекста должен приводить к выработке более обоснованных решений.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 38, "term_ru": "элективность решений", "term_en": "Electivity of Decisions", "definition": "Показатель эффективности СППР, характеризующий комплексность и полноту критериев, определяющих эффективность СППР и качество вырабатываемых решений.\nП р и м е ч а н и е – Комплексность и полноту критериев определяют на основе априорных знаний предметной области.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 39, "term_ru": "технологическая рациональность", "term_en": "Technological Rationality", "definition": "Показатель эффективности СППР, характеризуемый рациональностью решений, рекомендуемых системой для достижения целей ЛПР.\nП р и м е ч а н и е – Решения должны предлагаться в соответствии с критериями временной и ресурсной экономии, допустимой простоты, принципиальной доступности технических ресурсов, наличия вычислительных мощностей.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 40, "term_ru": "устойчивость решений", "term_en": "Stability of Decisions", "definition": "Показатель эффективности СППР, характеризующий малые изменения в результатах рекомендаций, вырабатываемых СППР, при малых изменениях во входных данных в том случае, если изменение входных данных не ведет к резкой смене режима функционирования СППР, в рамках которой вырабатывается решение.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 41, "term_ru": "полнота покрытия решений", "term_en": "Completeness of Solutions", "definition": "Показатель эффективности СППР, характеризующий полноту покрытия вариантов действий, допустимых при решении задач, на которые ориентирована поддержка принятия решений.\nП р и м е ч а н и е – Наиболее оптимальное покрытие вариантов решений, которые генерирует система, соответствует более эффективной СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 42, "term_ru": "адаптивность СППР", "term_en": "Adaptability of DSS", "definition": "Способность СППР обновлять базу знаний при поступлении данных, описывающих новые для системы сущности и ситуации, при сохранении изначально заложенных эксплуатационных характеристик.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 43, "term_ru": "самообучаемость СППР", "term_en": "Self-learning of the DSS", "definition": "Способность СППР автоматически формировать и использовать новые знания на основе поступающих в систему знаний и данных для актуализации правил принятия решения, усовершенствования работы компонента вывода и повышения эффективности СППР в целом.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 44, "term_ru": "оперативность СППР", "term_en": "Operativeness of DSS", "definition": "Способность СППР обрабатывать входные данные с целью формирования вариантов решений с требуемой заблаговременностью до того момента, когда ЛПР должно принять окончательное решение о предпринимаемых действиях.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 45, "term_ru": "однозначность решений", "term_en": "Unambiguity of Solutions", "definition": "Показатель эффективности СППР, характеризующий логически последовательное, не допускающее различных трактовок представление решения СППР, необходимое и достаточное для его применения в ходе решения поставленной задачи.\nП р и м е ч а н и е – Однозначность решения подразумевает, что любой из множественных вариантов решений соответствует требованию однозначности.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 46, "term_ru": "контролируемость решений", "term_en": "Controllability of Decisions", "definition": "Возможность управления показателями точности количественных параметров решений СППР в процессе эксплуатации за счет увеличения или уменьшения объемов данных и знаний, времени расчетов и (или) используемых вычислительных ресурсов.\nП р и м е ч а н и е – Контролируемость решений наиболее значима в ситуациях жестких временных рамок на время принятия решений, когда менее точное, но более быстрое решение является более приоритетным, чем более точное, но требующее больше вычислительных ресурсов. Напротив, при снижении требований к оперативности контролируемость решения может позволить выработать более точное решение.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 47, "term_ru": "валидируемость решений", "term_en": "Validity of Decisions", "definition": "Возможность проверки выработанных решений на соответствие ожиданиям ЛПР в условиях определенности и полноты данных.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 48, "term_ru": "робастность решений", "term_en": "Robustness of Decisions", "definition": "Показатель эффективности СППР, характеризующий степень изменчивости результатов рекомендаций, вырабатываемых СППР, в зависимости от степени искажений и неполноты входных данных.\nП р и м е ч а н и е – Более высокий уровень робастности соответствует большей устойчивости результатов работы СППР к уровню искажений во входных данных, хотя и может приводить к снижению точности в отдельных ситуациях.\n8 Создание и функционирование СППР", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 49, "term_ru": "создание СППР", "term_en": "Building of DSS", "definition": "Совокупность работ, включающая формулировку целей и задач, конкретизацию характеристик и предъявляемых к ней требований, определение входных данных с обеспечением полноты их номенклатуры, разработку базы знаний, выработку критериев принятия решений, определение контролируемых параметров, показателей эффективности СППР и порядка их оценки, выбор математического, аппаратного и программного обеспечения, разработку и воплощение модели жизненного цикла, результатом которых является СППР.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 50, "term_ru": "жизненный цикл СППР", "term_en": "Life Cycle Model of DSS", "definition": "Совокупность связанных процессов от формирования требований к процедуре поддержки принятия решений до технической реализации СППР, ее ввода в эксплуатацию, сопровождения, развития, использования, модернизации и вывода из эксплуатации.\nП р и м е ч а н и е – Типовые стадии жизненного цикла систем приведены в ГОСТ Р 57193. В зависимости от характеристик реализуемой СППР могут применяться все или только некоторые стадии жизненного цикла.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 51, "term_ru": "развитие СППР", "term_en": "Development of the DSS", "definition": "Целенаправленное улучшение характеристик, расширение или изменение функций СППР в целях обеспечения показателей эффективности.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 52, "term_ru": "сопровождение СППР", "term_en": "Maintenance of the DSS", "definition": "Деятельность, направленная на обеспечение устойчивого и корректного функционирования СППР в целях обеспечения показателей эффективности.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 53, "term_ru": "автоматический режим реализации функции СППР", "term_en": "Automated Mode of the Functioning of the DSS", "definition": "Режим выполнения функции СППР, при котором решения вырабатываются при наступлении определенных условий или поступлении данных в систему от внешних источников и предоставляются оператору СППР в форме уведомления независимо от действий самого оператора.\nП р и м е ч а н и е – В качестве внешних источников данных могут выступать датчики, другие информационные системы, действия внешних пользователей.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 54, "term_ru": "диалоговый режим реализации функции СППР", "term_en": "Interactive Mode of the Functioning of the DSS", "definition": "Режим выполнения функции СППР, при котором оператор управляет ходом выработки решений, изменяя входные данные или условия решения задачи на основе собственной интерпретации, поступающей информации и оценки текущих условий.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 55, "term_ru": "процесс валидации СППР", "term_en": "DSS Validation Process", "definition": "Процесс установления соответствия результатов работы СППР ожиданиям и требованиям ЛПР в условиях определенности и полноты данных, включая проверку на независимых данных.\nП р и м е ч а н и е – Процесс валидации является обязательным на стадии разработки СППР, однако в ходе эксплуатации СППР и накоплении новых данных процесс валидации рекомендуется периодически повторять.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 56, "term_ru": "макетирование СППР", "term_en": "DSS Mock-up Building", "definition": "Процесс создания макета СППР для экспериментальных исследований или исследовательских испытаний.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 57, "term_ru": "испытания СППР", "term_en": "DSS Test", "definition": "Экспериментальное определение соответствия функции, показателей эффективности и технических характеристик СППР установленным требованиям.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 58, "term_ru": "экспериментальные исследования СППР", "term_en": "DSS Experimental Studies", "definition": "Экспериментальное определение количественных и качественных характеристик СППР, условий ее работоспособности, выявление недостатков в действиях системы и в разработанной документации.", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 59, "term_ru": "опытная эксплуатация СППР", "term_en": "DSS Trial Operation", "definition": "Вид испытаний СППР, проводимый по установленной программе, целью которой является совершенствование процесса дальнейшей эксплуатации системы с учетом реальных условий использования и накопленного опыта применения.\nАлфавитный указатель терминов на русском языке\nадаптивность СППР 42\nалгоритм функционирования СППР 8\nархитектура СППР 15\nбаза знаний 28\nбаза моделей для поддержки принятия решений 24\nвалидируемость решений 47\nинтерфейс СППР 27\nиспытания СППР 57\nисследования СППР экспериментальные 58\nкачество решений, вырабатываемых СППР 34\nКИС 18\nКИТ 17\nкомпонент валидации результатов вычислений 32\nкомпонент вывода 30\nкомпонент самообучения 31\nкомпонент СППР диалоговый 25\nкомпонент СППР объяснительный 26\nконтекст выработки принятия решений 36\nконтролируемость решений 46\nкритерий принятия решений 4\nлицо, принимающее решение 3\nЛПР 3\nмакетирование СППР 56\nнеопределенность в принятии решений 16\nНТУ СППР 9\nобеспечение СППР математическое 22\nобеспечение СППР методическое 21\nоднозначность решений 45\nоперативность СППР 44\nоператор СППР 19\nперсонал СППР эксплуатационный 20\nполнота покрытия решений 41\nправила принятия решения 29\nприобретение знаний 14\nпроцесс валидации СППР 55\nразвитие СППР 51\nрациональность технологическая 39\nрежим реализации функции СППР автоматический 53\nрежим реализации функции СППР диалоговый 54\nробастность решений 48\nсамообучаемость СППР 43\nсистема информационная когнитивная 18\nсистема поддержки принятия решений 1\nситуативность решений 37\nситуация для принятия решений сложная 2\nсоздание СППР 49\nсопровождение СППР 52\nСППР групповая 11\nСППР интеллектуальная 12\nСППР персональная 10\nСППР 1\nсфокусированность СППР 35\nтехнология информационная когнитивная 17\nтехнология функционирования СППР 13\nуровень СППР научно-технический 9\nусловия принятия решений 5\nустойчивость решений 40\nфункция СППР 7\nхранилище CППР 23\nцель СППР 6\nцикл СППР жизненный 50\nэксплуатация СППР опытная 59\nэлективность решений 38\nэффективность СППР 33\nАлфавитный указатель эквивалентов терминов на английском языке\nAdaptability of DSS 42\nAutomated Mode of the Functioning of the DSS 53\nBase of Models for Decision Support 24\nBuilding of DSS 49\nCIS 18\nCIT 17\nCognitive Information System 18\nCognitive Information Technology 17\nCompleteness of Solutions 41\nComputations Results Validation Component 32\nConditions of Decisions Making 5\nControllability of Decisions 46\nDecision Maker 3\nDecision Making Context 36\nDecision Making Criteria 4\nDecision Rules 29\nDecision Support System 1\nDevelopment of the DSS 51\nDialogue Component of the DSS 25\nDifficult Situation for Decision Making 2\nDM 3\nDSS Architecture 15\nDSS Experimental Studies 58\nDSS Focus 35\nDSS Function 7\nDSS Functioning Algorithm 8\nDSS Goal 6\nDSS Interface 27\nDSS Mock-up Building 56\nDSS Operating Personnel 20\nDSS Operation Technology 13\nDSS Operator 19\nDSS S&TL 9\nDSS Storage 23\nDSS Test 57\nDSS Trial Operation 59\nDSS Validation Process 55\nDSS 1\nEfficiency of the DSS 33\nElectivity of Decisions 38\nExplanatory Component of the DSS 26\nGroup DSS 11\nInference Component 30\nIntelligent DSS 12\nInteractive Mode of the Functioning of the DSS 54\nKnowledge Acquisition 14\nKnowledge Base 28\nLife Cycle Model of DSS 50\nMaintenance of the DSS 52\nMathematical Support of DSS 22\nMethodological Support of DSS 21\nOperativeness of DSS 44\nPersonal DSS 10\nQuality of Solutions Generated by the DSS 34\nRobustness of Decisions 48\nScientific and Technical Level of the DSS 9\nSelf-learning Component 31\nSelf-learning of the DSS 43\nSituationality of Decisions 37\nStability of Decisions 40\nTechnological Rationality 39\nUnambiguity of Solutions 45\nUncertainty in Decision Making 16\nValidity of Decisions 47\nПриложение А\n(справочное)\nТермины и определения общетехнических понятий, необходимые для понимания текста стандарта\nА.1\nрешение (decision): Результат выбора между различными направлениями деятельности.\n[ГОСТ Р 57131–2016, пункт 3.3]\nА.2\nдеятельность по принятию решения (decisional activity): Деятельность, направленная на осуществление выбора.\n[ГОСТ Р 57131–2016, пункт 3.4]\nА.3\nограничение решения (decision constraint): Ограничения, накладываемые на значения параметров, определяющих выбор в пользу конкретного решения.\n[ГОСТ Р 57131–2016, пункт 3.5]\nА.4\nцель (принятия) решения (decision objective): Часть информации, указывающая на то, какие типы показателей деятельности являются целевыми.\n[ГОСТ Р 57131–2016, пункт 3.7]\nА.5\nпараметр решения; переменная решения (decision variable): Данные, на основании которых ответственное лицо принимает свои решения для достижения намеченных целей.\n[ГОСТ Р 57131–2016, пункт 3.8]\nА.6\nмодель (model): Сущность, воспроизводящая явление, объект или свойство объекта реального мира.\n[ГОСТ Р 57188–2016, пункт 2.1.1]\nА.7\nматематическая модель (mathematical model): Модель, в которой сведения об объекте моделирования представлены в виде математических символов и выражений.\n[ГОСТ Р 57188–2016, пункт 2.1.2]\nА.8\nбаза знаний (K-base; КВ): База данных, которая содержит правила логических выводов и информацию о человеческом опыте и знаниях экспертов в предметной области.\nП р и м е ч а н и е – В системах с самообучением база знаний содержит дополнительно информацию, получаемую из решения ранее встретившихся задач.\n[ГОСТ 33707–2016, пункт 4.78]\nА.9\nавтоматизированная система (automated system): Система, состоящая из комплекса средств автоматизации, реализующего информационную технологию выполнения установленных функций, и персонала, обеспечивающего его функционирование.\nП р и м е ч а н и я:", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
{"number": 1, "term_ru": "В зависимости от вида деятельности выделяют, например, следующие виды АС", "term_en": null, "definition": "автоматизированные системы управления (АСУ), системы автоматизированного проектирования (САПР), автоматизированные системы научных исследований (АСНИ) и др.\n2 В зависимости от вида управляемого объекта (процесса) АСУ подразделяют, например, на АСУ технологическими процессами (АСУТП), АСУ предприятиями (АСУП) и т. д.\n[ГОСТ Р 59853–2021, статья 2]\nА.10\nмодель жизненного цикла (life cycle model): Структурная основа процессов и действий, относящихся к жизненному циклу, которая также служит в качестве общего эталона для установления связей и понимания.\n[ГОСТ 57193–2016, пункт 4.1.20]\nA.11\nмакет для испытаний (test mock-up): Изделие, представляющее упрощенное воспроизведение объекта испытаний или его части и предназначенное для испытаний.\n[ГОСТ 16504–81, статья 10]\nА.12\nискусственный интеллект, ИИ (Artificial Intelligence): Комплекс технологических решений, позволяющий имитировать когнитивные функции человека (включая поиск решений без заранее заданного алгоритма) и получать при выполнении конкретных задач результаты, сопоставимые с результатами интеллектуальной деятельности человека или превосходящие их. Комплекс технологических решений включает в себя информационно-коммуникационную инфраструктуру, программное обеспечение (в том числе, в котором используются методы машинного обучения), процессы и сервисы по обработке данных и поиску решений.\n[Указ Президента Российской Федерации от 15 февраля 2024 № 124, «Национальная стратегия развития искусственного интеллекта на период до 2030 года», статья 5, перечисление, пункт а)]\nУДК 004.81:006.354\nУДК 004.81:006.354\nОКС 35.020\nОКС 35.020\nОКС 35.020\nОКС 35.020\nсистемы поддержки принятия решений, когнитивные информационные технологии\nсистемы поддержки принятия решений, когнитивные информационные технологии\nсистемы поддержки принятия решений, когнитивные информационные технологии\nсистемы поддержки принятия решений, когнитивные информационные технологии\nсистемы поддержки принятия решений, когнитивные информационные технологии\nсистемы поддержки принятия решений, когнитивные информационные технологии\nРуководитель Национального\nцентра когнитивных разработок Университета ИТМО\nРуководитель Национального\nцентра когнитивных разработок Университета ИТМО\nРуководитель Национального\nцентра когнитивных разработок Университета ИТМО\nА.В. Бухановский", "source_file": "Проект_ГОСТ_СППР_на_НК_б.docx"}
